﻿IDS_EC_REPORT_CH_TEST = "EC_Report_EN-Test(Lang:EN)"
IDS_EC_FOUNDATION_OVERTURNING_OCCURED = "เกิดการพลิกคว่ำ(Overturning) ยกเลิกการคำนวณ"
IDS_EC_FOUNDATION_OVERTURNED = "พลิกคว่ำ(Overturned)"
IDS_EC_FOUNDATION_DESIGN_LOAD = "น้ำหนักบรรทุกออกแบบ"
IDS_EC_FOUNDATION_SERVICE_LOAD = "น้ำหนักบรรทุกใช้งาน"
IDS_EC_FOUNDATION_FACTORED_LOAD = "น้ำหนักบรรทุกคูณค่าสัมประสิทธิ์"
IDS_EC_FOUNDATION_SURCHARGE_LOAD = "น้ำหนักบรรทุกเพิ่มเติม"
IDS_EC_FOUNDATION_SURFACE_LOAD = "น้ำหนักบรรทุกผิว"
IDS_EC_FOUNDATION_WEIGHT_DENSITY = "ความหนาแน่นน้ำหนัก"
IDS_EC_FOUNDATION_SOIL_HEIGHT = "ความสูงดิน"
IDS_EC_FOUNDATION_SELF_WEIGHT_CONSIDERED = "พิจารณาน้ำหนักตัวเองแล้ว"
IDS_EC_FOUNDATION_SELF_WEIGHT_NOT_CONSIDERED = "ไม่ได้พิจารณาน้ำหนักตัวเอง"
IDS_EC_FOUNDATION_DEPTH = "ความลึก"
IDS_EC_FOUNDATION_COLUMN_SECTION = "หน้าตัดเสา"
IDS_EC_FOUNDATION_SHAPE_COLUMN = "รูปทรงของเสา"
IDS_EC_FOUNDATION_RECTANGLE = "สี่เหลี่ยมผืนผ้า"
IDS_EC_FOUNDATION_CIRCLE = "วงกลม"
IDS_EC_FOUNDATION_ECCENTRICITY_X = "ความเบี่ยงเบน (X)"
IDS_EC_FOUNDATION_ECCENTRICITY_Y = "ความเบี่ยงเบน (Y)"
IDS_EC_FOUNDATION_WALL_SECTION = "หน้าตัดกำแพง"
IDS_EC_FOUNDATION_THICKNESS = "ความหนา"
IDS_EC_FOUNDATION_ECCENTRICITY = "ความเบี่ยงเบน"
IDS_EC_FOUNDATION_REBAR = "เหล็กเสริม"
IDS_EC_FOUNDATION_DIRECTION_X = "ทิศทาง X"
IDS_EC_FOUNDATION_LAYER__i = "ชั้น %i"
IDS_EC_FOUNDATION_DIRECTION_Y = "ทิศทาง Y"
IDS_EC_FOUNDATION_FOUNDATION = "ฐานราก"
IDS_EC_FOUNDATION_FOUNDATION_SIZE = "ขนาดฐานราก"
IDS_EC_FOUNDATION_WIDTH = "ความกว้าง"
IDS_EC_FOUNDATION_NO_OF_PILE = "จำนวนเสาเข็ม "
IDS_EC_FOUNDATION_SPACE_OF_PILE = "ระยะห่างของเสาเข็ม "
IDS_EC_FOUNDATION_CHECK_SOIL_CAPA = "ตรวจสอบความสามารถของดิน"
IDS_EC_FOUNDATION_CHECK_SOIL_STRESS = "ตรวจสอบความเค้นของดินในสภาวะใช้งานในโปรแกรมหลัก"
IDS_EC_FOUNDATION_CALC_SOIL_STRESS = "คำนวณความเค้นของดินบริการ"
IDS_EC_FOUNDATION_CALC_FACTORED_SOIL_STRESS = "คำนวณความเค้นของดินสูงสุด"
IDS_EC_FOUNDATION_CALC_SOIL_STRESS__s = "คำนวณความเค้นของดินในสภาวะใช้งาน (%s)"
IDS_EC_FOUNDATION_CALC_FACTORED_SOIL_STRESS__s = "คำนวณความเค้นของดินในสภาวะวิบัติ (%s)"
IDS_EC_FOUNDATION_CHECK_PILE_CAPA = "ตรวจสอบความสามารถของเสาเข็ม"
IDS_EC_FOUNDATION_CALC_ACTUAL_PILE_STRESS__s = "คำนวณแรงปฏิกิริยาเสาเข็มในสภาวะใช้งาน (%s)"
IDS_EC_FOUNDATION_CALC_FACTORED_PILE_STRESS__s = "คำนวณแรงปฏิกิริยาเสาเข็มในสภาวะวิบัติ (%s)"
IDS_EC_FOUNDATION_INDEX = "ดัชนี"
IDS_EC_FOUNDATION_AT_FACE = "ที่หน้า"
IDS_EC_FOUNDATION_AT_DIST2D = "ที่ระยะ-2D"
IDS_EC_FOUNDATION_CHECK_ONE_WAY_SHEAR = "ตรวจสอบแรงเฉือนทางเดียว"
IDS_EC_FOUNDATION_CHECK_TWO_WAY_SHEAR = "ตรวจสอบแรงเฉือนสองทาง"
IDS_EC_FOUNDATION_CALC_PAREMETER = "คำนวณพารามิเตอร์"
IDS_EC_FOUNDATION_COLUMN_FACE = "คำนวณแรงเฉือนที่หน้าตัดหน้าเสา"
IDS_EC_FOUNDATION_2D = "คำนวณแรงเฉือนที่ระยะ 2d"
IDS_EC_FOUNDATION_D = "คำนวณแรงเฉือนที่ระยะ d"
IDS_EC_FOUNDATION_CHECK_MOMENT_CAPA = "ตรวจสอบความสามารถโมเมนต์"
IDS_EC_FOUNDATION_CALC_MOMENT_CAPA__s = "คำนวณความสามารถโมเมนต์ (%s)"
IDS_EC_FOUNDATION_CALC_MOMENT_CAPA_AT_COLM_FACE = "คำนวณกำลังรับโมเมนต์ดัดที่หน้าเสา"
IDS_EC_FOUNDATION_REF_095D = "การอ้างอิงค่า 0.95d คือ 'The Concise Eurocode' 2006"
IDS_EC_FOUNDATION_CHECK_REBAR = "ตรวจสอบเหล็กเสริม"
IDS_EC_FOUNDATION_CALC_MINIMUM_REBAR_AREA_REQ = "คำนวณพื้นที่เหล็กเสริมขั้นต่ำที่ต้องการ"
IDS_EC_FOUNDATION_X_DIRECTION = "ทิศทาง X"
IDS_EC_FOUNDATION_Y_DIRECTION = "ทิศทาง Y"
IDS_EC_FOUNDATION_CALC_MINIMUM_REBAR_SPACE_REQ__s = "คำนวณขีดจำกัดระยะห่างเหล็กเสริมสูงสุด (%s)"
IDS_EC_FOUNDATION_SELF_WEIGHT = "น้ำหนักตัวเอง"
IDS_EC_FOUNDATION_COLUMN = "เสา"
IDS_EC_FOUNDATION_SHAPE = "รูปทรง"
IDS_EC_FOUNDATION_DIAMETER = "เส้นผ่านศูนย์กลาง"
IDS_EC_FOUNDATION_ECCENT_X = "ความเบี่ยงเบน(X)"
IDS_EC_FOUNDATION_ECCENT_Y = "ความเบี่ยงเบน(Y)"
IDS_EC_FOUNDATION_WALL = "กำแพง"
IDS_EC_FOUNDATION_LAYER_1_X = "ชั้น-1 (X)"
IDS_EC_FOUNDATION_LAYER_2_X = "ชั้น-2 (X)"
IDS_EC_FOUNDATION_LAYER_1_Y = "ชั้น-1 (Y)"
IDS_EC_FOUNDATION_LAYER_2_Y = "ชั้น-2 (Y)"
IDS_EC_FOUNDATION_PILE = "เสาเข็ม"
IDS_EC_FOUNDATION_SPACE = "ระยะห่าง"
IDS_EC_FOUNDATION_CHECK_CAPA = "ตรวจสอบความสามารถ"
IDS_EC_FOUNDATION_CHECK_ITEMS = "ตรวจสอบรายการ"
IDS_EC_FOUNDATION_UNIT = "หน่วย"
IDS_EC_FOUNDATION_CALCULATED = "คำนวณแล้ว"
IDS_EC_FOUNDATION_CRITIERIA = "เกณฑ์"
IDS_EC_FOUNDATION_SOIL_CAPA__s = "ความสามารถของดิน (%s)"
IDS_EC_FOUNDATION_MOMENT_X_DIR_MUY__s = "โมเมนต์ดัด-ทิศทาง X (Muy, %s)"
IDS_EC_FOUNDATION_MOMENT_Y_DIR_MUX__s = "โมเมนต์ดัด-ทิศทาง Y (Mux, %s)"
IDS_EC_FOUNDATION_ONE_WAY_SHEAR_X__s = "แรงเฉือนทางเดียว-X (%s)"
IDS_EC_FOUNDATION_ONE_WAY_SHEAR_Y__s = "แรงเฉือนทางเดียว-Y (%s)"
IDS_EC_FOUNDATION_TWO_WAY_SHEAR__s = "แรงเฉือนสองทาง (%s)"
IDS_EC_FOUNDATION_TWO_WAY_SHEAR_FACE_s = "แรงเฉือนสองทาง-หน้า (%s)"
IDS_EC_FOUNDATION_TWO_WAY_SHEAR_2D_s = "แรงเฉือนสองทาง-2D (%s)"
IDS_EC_FOUNDATION_TWO_WAY_SHEAR_D_s = "แรงเฉือนสองทาง-D (%s)"
IDS_EC_FOUNDATION_PILEPUNCHING_FACE_s = "การเจาะเสาเข็ม-หน้า (%s)"
IDS_EC_FOUNDATION_PILEPUNCHING_2D_s = "การเจาะเสาเข็ม-2D (%s)"
IDS_EC_FOUNDATION_PILE_CAPA_COMP__s = "กำลังรับน้ำหนักเสาเข็ม-อัด (%s)"
IDS_EC_FOUNDATION_PILE_CAPA_TENS__s = "กำลังรับน้ำหนักเสาเข็ม-ดึง (%s)"
IDS_EC_FOUNDATION_FOUNDATION_INPUT_LIST = "รายการข้อมูลฐานราก"
IDS_EC_FOUNDATION_INPUT_DATA_LIST = "รายการข้อมูลนำเข้า"
IDS_EC_FOUNDATION_DEPTH_COVER__s__s__s__s = "ความลึก = %s%s, ระยะหุ้มคอนกรีต = %s%s"
IDS_EC_FOUNDATION_DEPTH_DISTANCE__s__s__s__s = "ความลึก = %s%s, ระยะ = %s%s"
IDS_EC_FOUNDATION_GENERATING_FOUNDATION_REPORT = "กำลังสร้างรายงานฐานราก..."
IDS_EC_FOUNDATION_SHAPE_COLUMN_RECTANGLE = "รูปทรงของเสา \t: สี่เหลี่ยมผืนผ้า"
IDS_EC_FOUNDATION_SHAPE_COLUMN_CIRCLE = "รูปทรงของเสา \t: วงกลม"
IDS_EC_FOUNDATION_ECCENT_X__s__s = "ความเยื้องศูนย์ (X) \t: %s%s"
IDS_EC_FOUNDATION_ECCENT_Y__s__s = "ความเยื้องศูนย์ (Y) \t: %s%s"
IDS_EC_FOUNDATION_THICKNESS__s = "ความหนา \t: %s"
IDS_EC_FOUNDATION_ECCENT__s = "ความเยื้องศูนย์ \t: %s"
IDS_EC_FOUNDATION_WIDTH__s__s = "ความกว้าง \t: %s%s"
IDS_EC_FOUNDATION_X__s = "X(%s)"
IDS_EC_FOUNDATION_Y__s = "Y(%s)"
IDS_EC_FOUNDATION_PILE_PUNCHING = " : การเจาะทะลุที่เสาเข็ม"
IDS_EC_FOUNDATION_CALC_ONE_WAY_SHEAR_DIR_X = "คำนวณแรงเฉือนทางเดียว (ทิศทาง X)"
IDS_EC_FOUNDATION_CALC_ONE_WAY_SHEAR_DIR_Y = "คำนวณแรงเฉือนทางเดียว (ทิศทาง Y)"
IDS_EC_FOUNDATION_CHECK_MOMENT = "ตรวจสอบโมเมนต์"
IDS_EC_FOUNDATION_COLUMN__s = "เสา (%s)"
IDS_EC_FOUNDATION_WALL__s = "กำแพง (%s)"
IDS_EC_FOUNDATION_DEPTH_COVER_DIVIDE__s__s__s__s = "( ความลึก = %s%s, ระยะหุ้มคอนกรีต = %s%s / "
IDS_EC_FOUNDATION_DEPTH_DISTANCE_DIVIDE__s__s__s__s = "( ความลึก = %s%s, ระยะ = %s%s / "
IDS_EC_FOUNDATION_FCK_FY__s__s = "fck = %s%s, fyk = %s%s )"
IDS_EC_FOUNDATION_SELF_ENTER_WEIGHT = "น้ำหนักตัวเอง\n"
IDS_EC_FOUNDATION_ISNOT_ADJUST_DGN_MODULE = "เวอร์ชันของโมดูลออกแบบไม่เข้ากัน"
IDS_EC_FOUNDATION_FCK_FY__s__s__s__s = "fck = %s%s, fyk = %s%s"
IDS_EC_FOUNDATION_MOMENT_EFFECTIVE_DEPTH = "คำนวณความลึกโมเมนต์ที่มีประสิทธิภาพ"
IDS_EC_FOUNDATION_SHEAR_EFFECTIVE_DEPTH = "คำนวณความลึกแรงเฉือนที่มีประสิทธิภาพ"
IDS_EC_FOUNDATION_PILE_PUNCHING_NOTE1 = "หมายเหตุ : เมื่อตรวจสอบการเจาะทะลุที่เสาเข็ม จะถือว่าเสาเข็มเป็นเสาเข็มภายใน"
IDS_EC_FOUNDATION_PILE_PUNCHING_NOTE2 = "กำหนดเส้นรอบรูปวิกฤตโดยไม่พิจารณาเสาเข็มมุมหรือเสาเข็มขอบ"
IDS_EC_FOUNDATION_USER_D = "คำนวณแรงเฉือนที่ระยะ d ที่ผู้ใช้กำหนด"
IDS_EC_ONEWAY_SHEAR = "แรงเฉือนทางเดียว"
IDS_EC_ONEWAY_SHEAR_X = "แรงเฉือนทางเดียว-X"
IDS_EC_TWOWAY_SHEAR = "แรงเฉือนสองทาง"
IDS_EC_TWOWAY_SHEAR_CF = "แรงเฉือนสองทาง-หน้าเสา"
IDS_EC_TWOWAY_SHEAR_2D = "แรงเฉือนสองทาง-2D"
IDS_EC_TWOWAY_SHEAR_USERD = "แรงเฉือนสองทาง-UserD"
IDS_EC_OFFSET_FACTOR = "ปัจจัยการเลื่อน"
IDS_EC_MOMENT_Y_DIRECTION = "โมเมนต์-ทิศทาง Y"
IDS_EC_MOMENT_X_DIRECTION = "โมเมนต์-ทิศทาง X"
IDS_EC_CANTIL_MOMENT_X_DIRECTION = "โมเมนต์-ทิศทาง X( คานยื่น ) "
IDS_EC_COLUMN_MOMENT_X_DIRECTION = "โมเมนต์-ทิศทาง X( เสา ) "
IDS_EC_SPAN_MOMENT_X_DIRECTION = "โมเมนต์-ทิศทาง X( ช่วง ) "
IDS_EC_REBAR_SPACE_Y_DIRECTION = "ตรวจสอบระยะห่าง-Y"
IDS_EC_REBAR_SPACE_X_DIRECTION = "ตรวจสอบระยะห่าง-X"
IDS_EC_REBAR_AREA_Y_DIRECTION = "ตรวจสอบพื้นที่-Y"
IDS_EC_REBAR_AREA_X_DIRECTION = "ตรวจสอบพื้นที่-X"
IDS_EC_OFFSET = "การเลื่อน"
IDS_EC_FOUNDATION_SOIL_CAPA = "ความสามารถของดิน"
IDS_EC_FOUNDATION_SOIL_CAPA_EXPL = "ค่านี้อ้างอิงจากน้ำหนักบรรทุกในสภาวะใช้งาน"
IDS_EC_FOUNDATION_OVER_TURNING = "จะไม่แสดงค่า หากเกิดการพลิกคว่ำ"
IDS_EC_FOUNDATION_SOIL_DIAGRM = "แผนภาพความเค้นของดิน"
IDS_EC_SFD_DIAGRAM = "แผนภาพแรงเฉือน"
IDS_EC_BMD_DIAGRAM = "แผนภาพโมเมนต์ดัด"
IDS_EC_PLAN_SECT = "แผน & หน้าตัด"
IDS_EC_REBAR_MAX_AREA = "พื้นที่สูงสุด"
IDS_EC_REBAR_MIN_AREA = "พื้นที่ขั้นต่ำ"
IDS_EC_REBAR_REQ_AREA = "พื้นที่ที่ต้องการ"
IDS_EC_REBAR_MAX_SPACE = "ระยะห่างสูงสุด"
IDS_EC_CANTIL = "คานยื่น"
IDS_EC_COLUMN = "เสา"
IDS_EC_SPAN = "ช่วง"
IDS_EC_FOUNDATION_FDN_SECTION = "หน้าตัดฐานราก"
IDS_EC_FOUNDATION_FORCES_REINFORCEMENT = "แรงและเหล็กเสริม"
IDS_EC_FOUNDATION_INVERTED_T = "T กลับด้าน"
IDS_EC_FOUNDATION_ECC = "Ecc."
IDS_EC_FOUNDATION_MOMENT_TOP__s = "โมเมนต์ดัดบน (%s)"
IDS_EC_FOUNDATION_MOMENT_BOT__s = "โมเมนต์ดัดล่าง (%s)"
IDS_EC_FOUNDATION_SHEAR__s = "แรงเฉือน (%s)"
IDS_EC_FOUNDATION_TRANSE_MOMENT__s = "โมเมนต์ดัดขวาง (%s)"
IDS_EC_FOUNDATION_LX = "Lx"
IDS_EC_FOUNDATION_SECTION_BEAM_SIZE = "ขนาดคาน"
IDS_EC_FOUNDATION_MOMENTS_FORCES = "โมเมนต์และแรง"
IDS_EC_FOUNDATION_CALC_SHEAR_CAPA = "คำนวณความสามารถในการรับแรงเฉือน"
IDS_EC_FOUNDATION_FCK_FY_NOBRACKET__s__s = "fck = %s%s, fyk = %s%s"
IDS_EC_FOUNDATION_TOP_BAR = "เหล็กเสริมบน"
IDS_EC_FOUNDATION_BOTTOM_BAR = "เหล็กเสริมล่าง"
IDS_EC_FOUNDATION_BOT_BAR = "เหล็กเสริมล่างสุด"
IDS_EC_FOUNDATION_STIRRUP = "เหล็กเสริมขวาง"
IDS_EC_FOUNDATION_STANSVERSE_BAR = "เหล็กเสริมขวาง"
IDS_EC_FOUNDATION_STANS_BAR = "เหล็กขวาง"
IDS_EC_FOUNDATION_X = "X"
IDS_EC_FOUNDATION_Y = "Y"
IDS_EC_FOUNDATION_DIR_x = "x"
IDS_EC_FOUNDATION_DIR_y = "y"
IDS_EC_FOUNDATION__s_c = "%s_c$"
IDS_EC_FOUNDATION__s_s = "%s_s$"
IDS_EC_FOUNDATION_Fck = "f_ck$"
IDS_EC_FOUNDATION_Fy = "f_yk$"
IDS_EC_FOUNDATION_Ps = "P_Ed,s$"
IDS_EC_FOUNDATION_Msx = "M_Edx,s$"
IDS_EC_FOUNDATION_Msy = "M_Edy,s$"
IDS_EC_FOUNDATION_Pu = "N_Ed$"
IDS_EC_FOUNDATION_Mux = "M_Edx$"
IDS_EC_FOUNDATION_Muy = "M_Edy$"
IDS_EC_FOUNDATION_Mu_top = "M_Ed,top$"
IDS_EC_FOUNDATION_Mu_bottom = "M_Ed,bottom$"
IDS_EC_FOUNDATION_Mu_bot = "M_Ed,bot$"
IDS_EC_FOUNDATION_As = "A_s$"
IDS_EC_FOUNDATION_REBAR__s__s = "%s@%s"
IDS_EC_FOUNDATION_L_x = "L_x$"
IDS_EC_FOUNDATION_L_y = "L_y$"
IDS_EC_FOUNDATION_fe = "f_e$"
IDS_EC_FOUNDATION_EA = "EA"
IDS_EC_FOUNDATION_q_a_comp = "q_a,comp.$"
IDS_EC_FOUNDATION_q_a_tens = "q_a,tens.$"
IDS_EC_FOUNDATION_q_a = "q_a$"
IDS_EC_FOUNDATION_q_s_left = "q_s,left$"
IDS_EC_FOUNDATION_q_s_right = "q_s,right$"
IDS_EC_FOUNDATION_q_s_top_left = "q_s,top-left$"
IDS_EC_FOUNDATION_q_s_top_right = "q_s,top-right$"
IDS_EC_FOUNDATION_q_s_bot_left = "q_s,bot-left$"
IDS_EC_FOUNDATION_q_s_bot_right = "q_s,bot-right$"
IDS_EC_FOUNDATION_q_s_max = "q_s,max$"
IDS_EC_FOUNDATION_q_s_min = "q_s,min$"
IDS_EC_FOUNDATION_q_s = "q_s$"
IDS_EC_FOUNDATION_q_u_left = "q_u,left$"
IDS_EC_FOUNDATION_q_u_right = "q_u,right$"
IDS_EC_FOUNDATION_q_u_top_left = "q_u,top-left$"
IDS_EC_FOUNDATION_q_u_top_right = "q_u,top-right$"
IDS_EC_FOUNDATION_q_u_bot_left = "q_u,bot-left$"
IDS_EC_FOUNDATION_q_u_bot_right = "q_u,bot-right$"
IDS_EC_FOUNDATION_q_u_max = "q_u,max$"
IDS_EC_FOUNDATION_q_u_min = "q_u,min$"
IDS_EC_FOUNDATION_q_u = "q_u$"
IDS_EC_FOUNDATION_V_Ed = "V_Ed$"
IDS_EC_FOUNDATION_V_Edx = "V_Edx$"
IDS_EC_FOUNDATION_V_Edy = "V_Edy$"
IDS_EC_FOUNDATION_M_Ed__s = "M_Ed%s$"
IDS_EC_FOUNDATION_Ed = "_Ed$"
IDS_EC_FOUNDATION_V_Rd = "V_Rd$"
IDS_EC_FOUNDATION_V_Rdx = "V_Rdx$"
IDS_EC_FOUNDATION_V_Rdy = "V_Rdy$"
IDS_EC_FOUNDATION_M_Rd__s = "M_Rd%s$"
IDS_EC_FOUNDATION_Rd = "_Rd$"
IDS_EC_FOUNDATION_Rdmax = "_Rdmax$"
IDS_EC_FOUNDATION_As_min = "A_s,min$"
IDS_EC_FOUNDATION_APP_As_min = "A_s,min ที่ใช้"
IDS_EC_FOUNDATION_s_req = "s_req$"
IDS_EC_FOUNDATION_s_req1 = "s_req.1$"
IDS_EC_FOUNDATION_s_req2 = "s_req.2$"
IDS_EC_FOUNDATION_s__s = "s_%s$"
IDS_EC_FOUNDATION_L_SELF_WEIGHT = "น้ำหนักตัวเอง\n"
IDS_EC_FOUNDATION_L_SURFACE = "L_surface$"
IDS_EC_FOUNDATION_H_SOIL = "H_soil$"
IDS_EC_FOUNDATION_C_x = "C_x$"
IDS_EC_FOUNDATION_C_y = "C_y$"
IDS_EC_FOUNDATION_Ecc_x = "Ecc_x$"
IDS_EC_FOUNDATION_Ecc_y = "Ecc_y$"
IDS_EC_FOUNDATION_TOP = "บน"
IDS_EC_FOUNDATION_BOT = "ล่าง"
IDS_EC_FOUNDATION_LAYER__i__EA = "ชั้น %i\t : %i EA ("
IDS_EC_FOUNDATION_STRIRRUP__s = "เหล็กปลอก \t : %s ("
IDS_EC_FOUNDATION_TRANS_BAR__s__s = "เหล็กเสริมขวาง \t : %s-%s ("
IDS_EC_FOUNDATION_SURCHARGE_LOAD_NOT = "ไม่ได้พิจารณาน้ำหนักบรรทุกส่วนเพิ่ม"
IDS_EC_FOUNDATION_FOR_UNIT_WIDTH = "สำหรับความกว้างหน่วย"
IDS_EC_FOUNDATION_FOR_WHOLE_WIDTH = "สำหรับความกว้างทั้งหมด"
IDS_EC_MEMBER_NAME = "ชื่อเมมเบอร์"
IDS_EC_GENERAL_INFORMATION = "ข้อมูลทั่วไป"
IDS_EC_DESIGN_CODE = "รหัสการออกแบบ"
IDS_EC_UNIT_SYSTEM = "ระบบหน่วย"
IDS_EC_SECTION = "หน้าตัด"
IDS_EC_SECTION_SIZE = "ขนาดหน้าตัด"
IDS_EC_SECTION_SHAPE_T = "หน้าตัด T"
IDS_EC_SECTION_SHAPE_RECT = "หน้าตัด R"
IDS_EC_THICKNESS = "ความหนา"
IDS_EC_MATERIAL = "วัสดุ"
IDS_EC_REBAR_COVER = "ระยะคอนกรีตหุ้มเหล็ก"
IDS_EC_REBAR_DISTANCE = "ระยะห่าง"
IDS_EC_CONSIDERED = "พิจารณา"
IDS_EC_NOT_CONSIDERED = "ไม่พิจารณา"
IDS_EC_POSITION_CAPITAL = "ตำแหน่ง"
IDS_EC_POS = "POS"
IDS_EC_DESIGN_FORCES = "แรงออกแบบ"
IDS_EC_FORCES = "แรง"
IDS_EC_BY_LOAD_COMB = "โดยLoad Combinations"
IDS_EC_SURCHARGE_LOAD_SELF_WEIGHT = "น้ำหนักบรรทุกเพิ่มเติมและน้ำหนักตัวเอง"
IDS_EC_REINFORCEMENT = "เหล็กเสริม"
IDS_EC_TOP_BAR = "เหล็กเสริมบน"
IDS_EC_BOTTOM_BAR = "เหล็กเสริมล่าง"
IDS_EC_TOP = "บน"
IDS_EC_BOTTOM = "ล่าง"
IDS_EC_EXT_BAR = "เหล็กด้านนอก"
IDS_EC_INT_BAR = "เหล็กด้านใน"
IDS_EC_BOT = "ล่าง"
IDS_EC_EXT = "นอก"
IDS_EC_INT = "ใน"
IDS_EC_STIRRUP = "เหล็กเสริมขวาง"
IDS_EC_TRANSVERSE_BAR = "Transverse Bar"
IDS_EC_POSITION_I = "I"
IDS_EC_POSITION_M = "M"
IDS_EC_POSITION_J = "J"
IDS_EC_RATIO = "อัตราส่วน"
IDS_EC_LAYER = "ชั้น"
IDS_EC_REMARK = "หมายเหตุ"
IDS_EC_ITEMS = "รายการ"
IDS_EC_VALUE = "ค่า"
IDS_EC_INPUT_DATA_LIST = "รายการข้อมูลนำเข้า"
IDS_EC_LENGTH = "ความยาว"
IDS_EC_FACTOR = "ปัจจัย"
IDS_EC2_BEAM_GENERATE_REPORT = "กำลังสร้างรายงาน RC/คาน..."
IDS_EC2_BEAM_MOMENT_FORCES = "โมเมนต์และแรง"
IDS_EC2_BEAM_FORCE_REINFORCEMENT = "แรงและการเสริม"
IDS_EC2_BEAM_COMPRESSION_REBAR = "เหล็กเสริมแรงอัด"
IDS_EC2_BEAM_SPLICE_TYPE = "ประเภทการเชื่อม"
IDS_EC2_BEAM_REPORT_CALC_SHEAR_RATIO = "คำนวณอัตราส่วนกำลังรับแรงเฉือน"
IDS_EC2_BEAM_REPORT_CALC_STIRRUP_SPACE = "คำนวณระยะห่างเหล็กเสริมแรงเฉือน"
IDS_EC2_BEAM_REPORT_CALC_VRD_S = "คำนวณกำลังรับแรงเฉือนเมื่อมีเหล็กเสริมแรงเฉือน"
IDS_EC2_BEAM_REPORT_CALC_VRD_MAX = "คำนวณกำลังรับแรงเฉือนสูงสุดของหน้าตัด"
IDS_EC2_BEAM_CHECK_ONEWAY_SHEAR = "ตรวจสอบแรงเฉือนทางเดียว"
IDS_EC2_BEAM_CHECK_MOMENT_CAPACITY = "ตรวจสอบความสามารถในการรับโมเมนต์ดัด"
IDS_EC2_BEAM_CALC_MATL_DGN_STRENGTH = "คำนวณกำลังออกแบบของวัสดุ"
IDS_EC2_BEAM_CALC_DGN_PARAM = "คำนวณพารามิเตอร์การออกแบบ"
IDS_EC2_BEAM_CALC_REQ_REBAR_AREA = "คำนวณพื้นที่เหล็กเสริมที่ต้องการ"
IDS_EC2_BEAM_CALC_LIMIT_REBAR_AREA = "คำนวณขีดจำกัดพื้นที่เหล็กเสริม"
IDS_EC2_BEAM_CHECK_TENS_REBAR_AREA = "ตรวจสอบพื้นที่เหล็กเสริมรับแรงดึง"
IDS_EC2_BEAM_CALC_MOMENT_CAPACITY = "คำนวณความสามารถในการรับโมเมนต์"
IDS_EC2_BEAM_CALC_MOMENT_RATIO = "คำนวณอัตราส่วนกำลังรับโมเมนต์ดัด"
IDS_EC2_BEAM_SKIP_MOMENT_ZERO = "โมเมนต์ดัดเป็นศูนย์ ข้าม"
IDS_EC2_BEAM_CHECK_SHEAR_CAPACITY = "ตรวจสอบความสามารถในการรับแรงเฉือน"
IDS_EC2_BEAM_CALC_SHEAR_CAPACITY_CONC = "คำนวณกำลังรับแรงเฉือนโดยไม่มีเหล็กเสริมแรงเฉือน"
IDS_EC2_BEAM_REBAR_POSITIVE = "บวก"
IDS_EC2_BEAM_REBAR_NEGATIVE = "ลบ"
IDS_EC2_BEAM_REBAR_POSITIVE_INT = "บวก, ใน"
IDS_EC2_BEAM_REBAR_NEGATIVE_EXT = "ลบ, นอก"
IDS_EC2_BEAM_SLAB_THICKNESS = "ความหนาของพื้น"
IDS_EC2_BEAM_EFFECTIVE_WIDTH = "ความกว้างที่มีประสิทธิภาพ"
IDS_EC2_BEAM_INPUT_LIST_TITLE = "รายการข้อมูลนำเข้าสำหรับคาน"
IDS_EC2_ANALYSIS_AS_RECTANGLE_BEAM = "วิเคราะห์เป็นคานสี่เหลี่ยม"
IDS_EC2_ANALYSIS_AS_TEE_BEAM = "วิเคราะห์เป็นTee-beam"
IDS_EC2_DO_NOT_CHK_CRACK_WIDTH = "ไม่ตรวจสอบความกว้างรอยร้าว"
IDS_EC2_CRACK_LIMIT = "ขีดจำกัดการแตกร้าว"
IDS_EC2_CHK_CRACK_WIDTH = "ตรวจสอบความกว้างของรอยแตก"
IDS_EC2_CHK_CRACK_WIDTH_FACTORS = "ปัจจัยความกว้างของรอยแตก"
IDS_EC2_CHK_CRACK_OF_CHARACTERISTIC_LOAD = "ตรวจสอบรอยร้าวของน้ำหนักบรรทุก Characteristic"
IDS_EC2_CHK_CRACK_OF_QUASI_LOAD = "ตรวจสอบรอยร้าวของน้ำหนักบรรทุก Quasi-Permanent"
IDS_EC2_CHK_CRACK_OF_FREQUENT_LOAD = "ตรวจสอบรอยร้าวของน้ำหนักบรรทุก Frequent"
IDS_EC2_EXPOSURE_CLASS = "ประเภทการสัมผัส"
IDS_EC2_CHECK_STRESS_LIMITATION = "ตรวจสอบขีดจำกัดความเค้น"
IDS_EC2_CRITERIA_DEFLECTION = "เกณฑ์สำหรับการดัด"
IDS_EC2_FOR_CHARACTERISTIC_DEFLECTION = "สำหรับการโก่งตัวภายใต้น้ำหนักบรรทุกลักษณะเฉพาะ"
IDS_EC2_FOR_QUASI_PERMANENT_DEFLECTION = "สำหรับการโก่งตัวของน้ำหนักบรรทุก Quasi-Permanent"
IDS_EC2_DEFLECTION_AMPLIFICATION_FACTOR = "ปัจจัยการขยายตัวของการดัด"
IDS_EC2_DEFLECTION = "การดัด"
IDS_EC2_DIVIEDED_BY2_CANTILEVER = "หารด้วย 2 สำหรับคานยื่น"
IDS_EC2_SUPPORT = "การรองรับ"
IDS_EC2_SPAN = "ช่วง"
IDS_EC2_CHARACTERISTIC = "ลักษณะ"
IDS_EC2_QUASI_PERMANENT = "กึ่งถาวร"
IDS_EC2_FREQUENT = "บ่อย"
IDS_EC2_DURATION = "ระยะเวลา"
IDS_EC_DEAD = "น้ำหนักคงที่"
IDS_EC_DEAD_LOAD = "น้ำหนักบรรทุกคงที่"
IDS_EC_LIVE = "น้ำหนักบรรทุกจร"
IDS_EC_LIVE_LOAD = "น้ำหนักบรรทุกจร"
IDS_EC_SECT_DOT_UCASE = "SECT."
IDS_EC2_CHARACTERISTIC_DEFLECTION = "การโก่งตัวลักษณะเฉพาะ"
IDS_EC2_QUASI_PERMANENT_DEFLECTION = "การโก่งตัวกึ่งถาวร"
IDS_EC2_CHECK_DEFLECTION = "ตรวจสอบการดัด"
IDS_EC_SUPPORT_CONDITION = "เงื่อนไขการรองรับ"
IDS_EC_CHARACTERISTIC_DEFLECTION_FACTOR = "ปัจจัยการโก่งตัวลักษณะเฉพาะ"
IDS_EC_QUASI_DEFLECTION_FACTOR = "ปัจจัยการโก่งตัวกึ่งถาวร"
IDS_EC_DURATION_FOR_SUSTAIN_LOAD = "ระยะเวลาสำหรับน้ำหนักบรรทุกที่ยั่งยืน"
IDS_EC_SUSTAIN_LOAD = "น้ำหนักบรรทุกที่ยั่งยืน"
IDS_EC2_CBSF_MAIN_RIB = "ริบบิ้นหลัก"
IDS_EC2_CBSF_FLANGE_PART = "ส่วนฟลานจ์"
IDS_EC2_CBSF_CALC_FORCE_FLANGE_PART = "คำนวณแรงออกแบบ (ส่วนปีก)"
IDS_EC2_CBSF_FORCE_PARAM_FLANGE_PART = "พารามิเตอร์แรงการออกแบบ"
IDS_EC2_CBSF_FORCE_FLANGE_PART = "แรงการออกแบบ (ส่วนฟลานจ์)"
IDS_EC2_CBSF_SOIL_BEARING_CAPACITY = "ความสามารถในการรับน้ำหนักของดิน"
IDS_EC2_CBSF_CHECK_SOIL_BEARING_CAPACITY = "ตรวจสอบความสามารถในการรับน้ำหนักของดิน"
IDS_EC2_CBSF_CALC_SOIL_BEARING_RATIO = "คำนวณอัตราส่วนกำลังรับน้ำหนักของดิน"
IDS_EC2_CBSF_INPUT_LIST_TITLE = "รายการข้อมูลนำเข้า STRIP FOOTING ของคานต่อเนื่อง"
IDS_EC2_CBSF_GENERATING_CBSF_REPORT = "กำลังสร้างรายงานฐานรากแถบ..."
IDS_EC_FOUNDATION_MOMENT_X_DIR_MEDY__s = "โมเมนต์ดัด-ทิศทาง X (MEdy, %s)"
IDS_EC_FOUNDATION_MOMENT_Y_DIR_MEDX__s = "โมเมนต์ดัด-ทิศทาง Y (MEdx, %s)"
IDS_EC2_CWALL_INPUT_LIST_TITLE = "รายการข้อมูลนำเข้าสำหรับกำแพงรวม"
IDS_EC2_CWALL_GENERATING_CWALL_REPORT = "กำลังสร้างรายงานกำแพงรวม..."
IDS_EC2_CWALL_WALL_ID = "Wall ID"
IDS_EC_LOAD_COMBINATIONS = "การรวมกันของน้ำหนักบรรทุก"
IDS_EC_LCB = "LCB"
IDS_EC2_CWALL_START_POINT = "จุดเริ่มต้น"
IDS_EC2_CWALL_END_POINT = "จุดสิ้นสุด"
IDS_EC_INFORMATION = "ข้อมูล"
IDS_EC_SPACING_LIMIT = "ขีดจำกัดระยะห่าง"
IDS_EC2_CWALL_VERT_REBAR_POSITION = "ตำแหน่งเหล็กเสริมแนวตั้ง"
IDS_EC2_CWALL_VERT_REBAR = "เหล็กเสริมแนวตั้ง"
IDS_EC2_CWALL_HORZ_REBAR = "เหล็กเสริมแนวนอน"
IDS_EC2_CWALL_END_REBAR = "เหล็กเสริมปลาย"
IDS_EC2_CWALL_REBAR_ARRANGEMENT = "การจัดเรียง"
IDS_EC2_CWALL_REBAR_ARRANGEMENT_DIVIDE_EQUALLY = "แบ่งเท่า ๆ กันตามระยะที่ใกล้ที่สุด"
IDS_EC2_CWALL_REBAR_ARRANGEMENT_DIVIDE_EXACT = "แบ่งตามระยะห่างที่แน่นอน"
IDS_EC2_CWALL_REBAR_ARRANGEMENT_FROM_END = "จากปลาย"
IDS_EC2_CWALL_REBAR_ARRANGEMENT_FROM_MID = "จากกึ่งกลาง"
IDS_EC2_CWALL_REBAR_ARRANGEMENT_ADD_REBAR = "เพิ่มเหล็กเสริม"
IDS_EC_CHECK_SLENDERNESS_RATIO = "ตรวจสอบอัตราส่วนความเพรียว"
IDS_EC_CALC_RADIUS_GYRATION = "คำนวณรัศมีการหมุน"
IDS_EC_CALC_SLENDERNESS_RATIO = "คำนวณอัตราส่วนความเพรียว"
IDS_EC_CALC_SLENDERNESS_RATIO_LIMIT = "คำนวณอัตราส่วนความเพรียวที่จำกัด"
IDS_EC_SLENDER = "เพรียว(Slender)"
IDS_EC_NOT_SLENDER = "ไม่เพรียว"
IDS_EC_CHECK_MIN_MOMENT = "ตรวจสอบโมเมนต์ขั้นต่ำ"
IDS_EC_CALC_MIN_MOMENT = "คำนวณโมเมนต์ขั้นต่ำ"
IDS_EC_CALC_MIN_ECCEN = "คำนวณการเบี่ยงเบนขั้นต่ำ"
IDS_EC_CHECK_DESIGN_MOMENT = "ตรวจสอบโมเมนต์การออกแบบ"
IDS_EC_CALC_DESIGN_MOMENT = "คำนวณโมเมนต์การออกแบบ"
IDS_EC_DESIGN_MOMENT = "โมเมนต์การออกแบบ"
IDS_EC_X_DIRECTION = "ทิศทาง X"
IDS_EC_Y_DIRECTION = "ทิศทาง Y"
IDS_EC_CHECK_DESIGN_PARAMETER = "ตรวจสอบพารามิเตอร์การออกแบบ"
IDS_EC_CALC_REBAR_RATIO = "คำนวณอัตราส่วนเหล็กเสริม"
IDS_EC_CALC_ECCENTRICITY = "คำนวณการเบี่ยงเบน"
IDS_EC_ROTATION_NA = "มุมหมุนของแกนเป็นกลาง"
IDS_EC_CALC_CONCEN_AXIAL_CAPACITY = "คำนวณกำลังรับแรงตามแนวแกนกรณีแรงผ่านจุดศูนย์กลาง"
IDS_EC_CHECK_MOMENT_CAPACITY = "ตรวจสอบความสามารถในการรับโมเมนต์"
IDS_EC_CALC_CAPACITY_CONCRETE = "คำนวณกำลังรับของบล็อกความเค้นอัด"
IDS_EC_CALC_CAPACITY_REBAR = "คำนวณความสามารถของเหล็กเสริม"
IDS_EC_CALC_NORMINAL_CAPACITY_FOR_NA = "คำนวณกำลังรับตามนามบัญญัติสำหรับแกนเป็นกลาง"
IDS_EC_CALC_AXIAL_MOMENT_CAPACITY = "คำนวณกำลังรับน้ำหนักบรรทุกตามแนวแกนและกำลังรับโมเมนต์ดัด"
IDS_EC_CHECK_SHEAR_CAPACITY = "ตรวจสอบความสามารถในการรับแรงเฉือน"
IDS_EC_CALC_STIRRUP_MAX_SPACE = "คำนวณระยะห่างสูงสุด"
IDS_EC_CALC_SHEAR_STRENGTH = "คำนวณความแข็งแรงของแรงเฉือน"
IDS_EC_LENGTH_FACTOR = "ความยาวและปัจจัย"
IDS_EC_MOMENT_CAPACITY = "ความสามารถในการรับโมเมนต์"
IDS_EC_SHEAR_CAPACITY = "ความสามารถในการรับแรงเฉือน"
IDS_EC_CHECK_ITEM = "ตรวจสอบรายการ"
IDS_EC_NO = "No"
IDS_EC_CHK = "CHK"
IDS_EC_NAME = "ชื่อ"
IDS_EC_DESCRIPTION = "คำอธิบาย"
IDS_EC_DESIGN_FORCE = "แรงการออกแบบ"
IDS_EC2_CWALL_FLANGE_WIDTH = "ความกว้างของฟลานจ์"
IDS_EC2_CWALL_FLANGE_WIDTH_ACTUAL = "ความกว้างจริง"
IDS_EC2_CWALL_FLANGE_WIDTH_EFFECT = "ความกว้างที่มีผล"
IDS_EC2_CWALL_GLOBAL = "Global"
IDS_EC_SHEAR_REINFORCEMENT_NOT_REQUIRED = "ไม่ต้องใช้เหล็กเสริมแรงเฉือน"
IDS_EC_SHEAR_REINFORCEMENT_REQUIRED = "ต้องใช้เหล็กเสริมแรงเฉือน"
IDS_EC_2ND_ORDER_EFFECT = "ผลกระทบลำดับที่ 2"
IDS_EC_IMPERFECTION = "ความไม่สมบูรณ์"
IDS_EC_AUTO_CALC = "คำนวณอัตโนมัติ"
IDS_ERCO_MOMENT_CAPACITY = "ตรวจสอบความสามารถของโมเมนต์"
IDS_ERCO_NOMINAL_CAPACITY_BALANCED = "คำนวณกำลังรับตามนามบัญญัติสำหรับแกนสมดุล"
IDS_ERCO_NOMINAL_CAPACITY_FOR_NEUTRAL_AXIS = "คำนวณกำลังรับน้ำหนักตามนามบัญญัติสำหรับแกนเป็นกลาง"
IDS_ERCO_BANLANCED_AXIS = "แกนที่สมดุล"
IDS_ERCO_NEUTRAL_AXIS = "แกนกลาง"
IDS_ERCO_CAPACITY_REBAR = "คำนวณความสามารถของเหล็กเสริม"
IDS_ERCO_CAPACITY_COMPRESSION_BLOCK = "คำนวณกำลังรับน้ำหนักของบล็อกความเค้นอัด"
IDS_CALC_STRENGTH_REDUCTION_FACTOR = "คำนวณปัจจัยการลดความต้านทาน"
IDS_EC_ERCO_GENERATE_REPORT = "กำลังสร้างรายงานเสา RC..."
IDS_EC_ERCO_CHK_SERVICEABILITY = "ตรวจสอบความสามารถในการให้บริการ"
IDS_EC_ERCO_SERVICEABILITY_FACTORS = "ปัจจัยความสามารถในการให้บริการ"
IDS_EC_ERCO_CHK_CHARACTERISTIC_LOAD_STRESS_OF_CONC = "ตรวจสอบน้ำหนักบรรทุกลักษณะเฉพาะ ( ความเค้นของคอนกรีต )"
IDS_EC_ERCO_CHK_QUASI_LOAD_LINEAR_CREEP = "ตรวจสอบน้ำหนักบรรทุกกึ่งถาวร ( การคืบเชิงเส้น )"
IDS_EC_ERCO_CHK_FREQUENT_LOAD_STRESS_OF_CONC = "ตรวจสอบน้ำหนักบรรทุกที่เกิดบ่อย ( ความเค้นของคอนกรีต )"
IDS_EC_ERCO_CRACKED_SECTION = "หน้าตัดที่มีรอยแตก"
IDS_EC_ERCO_UNCRACKED_SECTION = "หน้าตัดที่ไม่มีรอยแตก"
IDS_EC_ERCO_LINEAR_CREEP = "การเคลื่อนตัวเชิงเส้น"
IDS_EC_ERCO_NONLINEAR_CREEP = "การเคลื่อนตัวไม่เชิงเส้น"
IDS_EC_ERCO_LONG_TERM = "ระยะยาว"
IDS_EC_ERCO_SHORT_TERM = "ระยะสั้น"
IDS_URGC_EFFECTIVE_AREA = "พื้นที่ที่มีผล"
IDS_URGC_GENERATE_REPORT = "กำลังสร้างรายงานเสาหน้าตัดทั่วไป RC..."
IDS_URGC_GEN_COLUMN_INPUT_LIST = "รายการข้อมูลนำเข้าเสาหน้าตัดทั่วไป RC"
IDS_ESBC_INPUT_LIST = "รายการข้อมูลนำเข้าการต่อด้วยสลักเกลียวเหล็ก"
IDS_ESBC_PLATE = "แผ่น"
IDS_ESBC_PLATE_WEB = "แผ่น (เว็บ)"
IDS_ESBC_PLATE_FLANGE = "แผ่น (ฟลานจ์)"
IDS_ESBC_BOLT = "น็อต"
IDS_ESBC_EXTENSION = "การขยาย"
IDS_ESBC_AUTO = "อัตโนมัติ"
IDS_ESBC_SUPPORTED_MEM = "Memberที่ถูกค้ำยัน"
IDS_ESBC_SUPPORTING_MEM = "Memberที่ทำหน้าที่ค้ำยัน"
IDS_ESBC_BOLT_TYPE = "ประเภทน็อต"
IDS_ESBC_WELDING = "การเชื่อม"
IDS_ESBC_WELDING_MATERIAL_AND_LEG = "วัสดุและขา"
IDS_ESBC_WELDING_MATERIAL = "วัสดุการเชื่อม"
IDS_ESBC_WELDING_LEG = "ขาของการเชื่อม"
IDS_ESBC_MAX_VALUE = "ค่าสูงสุด"
IDS_ESBC_NOT_CHK = "ไม่ตรวจสอบ"
IDS_ESBC_CHK_MAX_VALUE = "ตรวจสอบค่าระยะห่างและค่าระยะยื่นสูงสุด"
IDS_ESBC_NOT_CHK_MAX_VALUE = "ไม่ตรวจสอบค่าระยะห่างและค่าระยะยื่นสูงสุด"
IDS_ESBC_LEVEL_AND_GAP = "ระดับและช่องว่าง"
IDS_ESBC_LEVEL = "ระดับ"
IDS_ESBC_GAP = "ช่องว่าง"
IDS_ESBC_PERCENT = "เปอร์เซ็นต์"
IDS_ESBC_APPLY = "นำไปใช้"
IDS_ESBC_DIVISION = "แผ่นแบ่ง"
IDS_ESBC_DIVISION_APPLY = "ใช้แผ่นแบ่ง"
IDS_ESBC_DIVISION_NOT_APPLY = "ไม่ใช้แผ่นแบ่ง"
IDS_ESBC_APPLIED_FORCE = "แรงที่ใช้"
IDS_ESBC_MEMB_STRENGTH = "ความสามารถในการรับแรงของเมมเบอร์"
IDS_ESBC_CHK_FLG_COVER_PLATE = "ตรวจสอบแผ่นปิดฟลานจ์"
IDS_ESBC_CHK_NET_TENSION = "ตรวจสอบการเกิดแรงดึงสุทธิ"
IDS_ESBC_CHK_NET_TENSION_OCCUR = "เกิดแรงดึงสุทธิ"
IDS_ESBC_CHK_NET_TENSION_NOT_OCCUR = "ไม่เกิดแรงดึงสุทธิ"
IDS_ESBC_CHK_PLATE_RESIS = "ตรวจสอบความต้านทานแผ่น"
IDS_ESBC_CHK_BOLT_GROUP = "ตรวจสอบกลุ่มน็อต"
IDS_ESBC_CHK_MIN_RESIS = "ตรวจสอบความต้านทานขั้นต่ำ"
IDS_ESBC_CHK_CHK_COVER_PLATE = "ตรวจสอบแผ่นปิด"
IDS_ESBC_CHK_DIMENSION = "ตรวจสอบมิติ"
IDS_ESBC_CHK_PLATE = "ตรวจสอบแผ่น"
IDS_ESBC_CHK_FLG_WEB_DIMENSION = "ตรวจสอบมิติของแผ่นปีกและแผ่นเอว"
IDS_ESBC_CHK_THIK = "ตรวจสอบความหนา"
IDS_ESBC_CHK_SPACING = "ตรวจสอบระยะห่าง"
IDS_ESBC_CHK_PART_BOLT = "น็อต"
IDS_ESBC_CHK_PART_WEB = "เว็บ"
IDS_ESBC_CHK_PART_FLANGE = "ฟลานจ์"
IDS_ESBC_CHK_PART_PLATE = "แผ่น"
IDS_ESBC_CHK_PART_COLUMN = "เสา"
IDS_ESBC_CHK_PART_CONNECT = "การเชื่อมต่อ"
IDS_ESBC_CHK_PART_PLATE_FIN = "แผ่นฟิน"
IDS_ESBC_CHK_PART_PLATE_END = "แผ่นปลาย"
IDS_ESBC_CHK_PART_PLATE_DIV = "แผ่นแบ่ง"
IDS_ESBC_CHK_SUPPORTED_MEM = "ตรวจสอบเมมเบอร์ที่ถูกรองรับ"
IDS_ESBC_CHK_CONNECTION = "ตรวจสอบการเชื่อมต่อ"
IDS_ESBC_CHK_SUPPORTING_MEM = "ตรวจสอบเมมเบอร์ที่รองรับ"
IDS_ESBC_CHK_TYING_RESISTANCE = "ตรวจสอบความต้านทานการผูก"
IDS_ESBC_CHK_STRUCT_INTEGRITY = "ตรวจสอบความสมบูรณ์ของโครงสร้าง"
IDS_ESBC_CHK_SUPPORTED_WELD = "ตรวจสอบแนวเชื่อมของเมมเบอร์ที่ถูกยึดรองรับ"
IDS_ESBC_CHK_SUPPORTED_WEB = "ตรวจสอบกำลังต้านทานแรงเฉือนของเอว"
IDS_ESBC_CHK_SUPPORTED_RESIS_NOTCH = "ตรวจสอบกำลังต้านทานที่รอยบาก"
IDS_ESBC_CHK_SUPPORTED_LOCAL_STA = "ตรวจสอบความเสถียรภาพเฉพาะที่(local)"
IDS_ESBC_CHK_SUPPORTED_BOLT_GROUP = "ตรวจสอบกลุ่มสลักเกลียวของรอยต่อ"
IDS_ESBC_CHK_SUPPORTED_PLATE_SHEAR = "ตรวจสอบแผ่นในแรงเฉือน"
IDS_ESBC_CHK_SUPPORTING_SHEAR_BEARING = "ตรวจสอบแรงเฉือนและแรงกดแบริงของmemberที่รองรับ"
IDS_ESBC_CHK_TYING_PLATE_BOLT = "ตรวจสอบแผ่นและน็อต"
IDS_ESBC_CHK_TYING_SUPPORTED_WEB = "ตรวจสอบกำลังต้านทานของเอวของmemberที่ถูกยึดรองรับ"
IDS_ESBC_CHK_TYING_WELD = "ตรวจสอบความต้านทานของการเชื่อม"
IDS_ESBC_CHK_TYING_SUPPORTING_COL = "ตรวจสอบกำลังต้านทานของเอวของเสาที่รองรับ"
IDS_ESBC_CHK_NO_NEED_LOCAL_STABILITY = "ไม่จำเป็นต้องพิจารณาเสถียรภาพเฉพาะที่ของคานที่มีรอยบาก"
IDS_ESBC_CHK_NEED_LOCAL_STABILITY = "จำเป็นต้องพิจารณาเสถียรภาพเฉพาะที่ของคานที่มีรอยบาก"
IDS_ESBC_SHEAR = "แรงเฉือน"
IDS_ESBC_LOW_SHEAR = "แรงเฉือนต่ำ"
IDS_ESBC_HIGH_SHEAR = "แรงเฉือนสูง"
IDS_ESBC_CHK_SHEAER_BOLT_GROUP = "ตรวจสอบแรงเฉือนของกลุ่มสลักเกลียว"
IDS_ESBC_CHK_BOLT_BEARING_PLATE = "ตรวจสอบแรงกดแบริงของสลักเกลียวในแผ่น"
IDS_ESBC_CHK_BOLT_BEARING_WEB = "ตรวจสอบแรงกดแบริงของสลักเกลียวในเอวของmemberที่ถูกยึดรองรับ"
IDS_ESBC_CHK_SHAER_PLATE = "ตรวจสอบแรงเฉือนของแผ่น"
IDS_ESBC_CHK_BENADING_PLATE = "ตรวจสอบการดัดของแผ่น"
IDS_ESBC_CHK_BUCKLING_PLATE = "ตรวจสอบการบิดเบี้ยวด้านข้าง"
IDS_ESBC_CHK_WEB_SHEAR = "ตรวจสอบเว็บในแรงเฉือน"
IDS_ESBC_CHK_SHEAR_NOTCH = "ตรวจสอบเอวภายใต้แรงเฉือนของmemberที่ถูกยึดรองรับซึ่งมีรอยบาก"
IDS_ESBC_CHK_RESIS_CONNEC = "ตรวจสอบกำลังต้านทานที่รอยต่อ"
IDS_ESBC_CHK_RESIS_NOTCH = "ตรวจสอบกำลังต้านทานที่รอยบาก"
IDS_ESBC_CHK_LOCAL_STABILITY = "ตรวจสอบเสถียรภาพเฉพาะที่ (Local)"
IDS_ESBC_CHK_WELDING_SUPPORTING = "ตรวจสอบการเชื่อมของmemberที่รองรับ"
IDS_ESBC_CHK_SHEAR_N_BENDING = "ตรวจสอบแรงเฉือนและการรับแรง"
IDS_ESBC_CHK_PLATE_TENSION = "ตรวจสอบกำลังต้านทานแรงดึงของแผ่น"
IDS_ESBC_CHK_PLATE_BOLT_SHEAR = "ตรวจสอบแรงเฉือนของสลักเกลียวของแผ่น"
IDS_ESBC_CHK_TENSION_REIS_WEB = "ตรวจสอบกำลังต้านทานแรงดึงของเอวคาน"
IDS_ESBC_CHK_WEB_SUPPORTED = "ตรวจสอบเอวของmemberที่ถูกยึดรองรับ"
IDS_ESBC_CHK_SUPPORTING_COL = "ตรวจสอบเสาที่สนับสนุน"
IDS_ESBC_CHK_LONG_FIN_PLATE = "แผ่นฟินยาว"
IDS_ESBC_CHK_SHORT_FIN_PLATE = "แผ่นฟินสั้น"
IDS_ESBC_CHK_SHEAR_RATIO = "อัตราแรงเฉือน"
IDS_ESBC_CHK_PUNCHING_RATIO = "อัตราการเจาะ"
IDS_ESBC_ORDINARY = "ปกติ"
IDS_ESBC_COUNTERSUNK = "จม"
IDS_ESBC_SPACE_X = "ช่องว่าง(x)"
IDS_ESBC_SPACE_Y = "ช่องว่าง(y)"
IDS_ESBC_EXTENSION_X = "การขยาย(x)"
IDS_ESBC_EXTENSION_Y = "การขยาย(y)"
IDS_ESBC_CHK_EXTENSION = "ตรวจสอบการขยาย"
IDS_UCFT_GENERATE_REPORT = "กำลังสร้างรายงานเสา SRC CFT..."
IDS_UCFT_MATERIAL_STRENGTH_LIMITATION = "ข้อจำกัดความต้านทานวัสดุ"
IDS_UCFT_STEEL_SECTION_AREA_RATIO = "อัตราส่วนพื้นที่หน้าตัดเหล็ก"
IDS_UCFT_CALC_FORCE_ALLOCATION = "คำนวณการจัดสรรแรง"
IDS_UCFT_REQUIRED_SHEAR_FORCE_TRANSFERRED_SHEAR_CONNECTOR = "แรงเฉือนที่ต้องการซึ่งถ่ายโอนโดยตัวเชื่อมแรงเฉือน"
IDS_UCFT_CALC_DIRECT_BOND_STRENGTH = "คำนวณความต้านทานการยึดติดโดยตรง"
IDS_UCFT_FILLED_COMPOSITE_COLUMN_EXTEND_TO_ONE_SIDE = "เสาคอมโพสิตแบบเติมเต็มยื่นออกไปด้านเดียว"
IDS_UCFT_FILLED_COMPOSITE_COLUMN_EXTEND_TO_BOTH_SIDE = "เสาคอมโพสิตแบบเติมเต็มยื่นออกไปทั้งสองด้าน"
IDS_UCFT_CHECK_SECTION_CLASSIFICATION = "ตรวจสอบการจำแนกประเภทหน้าตัด"
IDS_UCFT_CHECK_CLASSIFICATION = "การจำแนกประเภท"
IDS_UCFT_AXIAL = "แกน"
IDS_UCFT_FLEXURE = "การดัด"
IDS_UCFT_FOR_AXIAL = "สำหรับแกน"
IDS_UCFT_FOR_FLEXURE = "สำหรับการดัด"
IDS_UCFT_TREATED_COMPACT = "ดังนั้น หน้าตัดทั้งหมดจึงพิจารณาเป็นหน้าตัดแบบคอมแพกต์"
IDS_UCFT_TREATED_NONCOMPACT = "ดังนั้น หน้าตัดทั้งหมดจึงพิจารณาเป็นหน้าตัดแบบไม่คอมแพกต์"
IDS_UCFT_OVER_LAMDA_MAX = "ดังนั้น อัตราส่วนความกว้างต่อความหนาของหน้าตัดทั้งหมดจึงเกินเกณฑ์"
IDS_UCFT_OVER = "เกิน"
IDS_UCFT_UNDER = "ใต้"
IDS_UCFT_SEISMIC = "แผ่นดินไหว"
IDS_UCFT_SPECIAL_PROVISION = "ข้อกำหนดพิเศษ"
IDS_UCFT_HIGH_DUCTILITY = "ความยืดหยุ่นสูง"
IDS_UCFT_MIDDLE_DUCTILITY = "ความยืดหยุ่นกลาง"
IDS_UCFT_PLASTIC_MOMENT_ABOUT_MAJOR_AXIS = "ตรวจสอบกำลังโมเมนต์ดัดพลาสติกเกี่ยวกับแกนหลัก"
IDS_UCFT_PLASTIC_MOMENT_ABOUT_MINOR_AXIS = "ตรวจสอบกำลังโมเมนต์ดัดพลาสติกเกี่ยวกับแกนรอง"
IDS_UCFT_YIELD_MOMENT_ABOUT_MAJOR_AXIS = "ตรวจสอบกำลังโมเมนต์ดัดที่ความเค้นครากเกี่ยวกับแกนหลัก"
IDS_UCFT_YIELD_MOMENT_ABOUT_MINOR_AXIS = "ตรวจสอบกำลังโมเมนต์ดัดที่ความเค้นครากเกี่ยวกับแกนรอง"
IDS_UCFT_FIRSR_YIELD_MOMENT_ABOUT_MAJOR_AXIS = "ตรวจสอบกำลังโมเมนต์ดัดที่ความเค้นครากครั้งแรกเกี่ยวกับแกนหลัก"
IDS_UCFT_FIRSR_YIELD_MOMENT_ABOUT_MINOR_AXIS = "ตรวจสอบกำลังโมเมนต์ดัดที่ความเค้นครากครั้งแรกเกี่ยวกับแกนรอง"
IDS_UCFT_BY_AUROMESH = "AutoMesh"
IDS_UCCO_STEEL_HSS = "เหล็ก HSS"
IDS_UCCO_CHECK_LOAD_TRANSFER = "ตรวจสอบการถ่ายโอนน้ำหนัก"
IDS_UCCO_MATERIAL_N_SECTION = "วัสดุ & หน้าตัด"
IDS_UCCO_CONCRETE_MATERIAL = "วัสดุคอนกรีต"
IDS_UCCO_STEEL_MATERIAL = "วัสดุเหล็ก"
IDS_UCCO_STEEL_SHAPE = "รูปทรงเหล็ก"
IDS_UCCO_EXTERNAL_FORCE_TO = "แรงภายนอกไปยัง"
IDS_UCCO_CFT_MEMBER_EXTEND_TO = "เมมเบอร์ CFT ขยายไปยัง"
IDS_UCCO_LOAD_TRANSFER = "การถ่ายโอนน้ำหนัก"
IDS_UCCO_CHECK_LIMITATION = "ตรวจสอบข้อจำกัด"
IDS_UCCO_CHECK_MOMENT_STRENGTH = "ตรวจสอบความแข็งแรงโมเมนต์"
IDS_UCCO_GENERATE_REPORT = "กำลังสร้างรายงานเสา SRC..."
IDS_UCCO_USE_CRITERIA_VALUE = "ใช้ค่ามาตรฐาน"
IDS_UCCO_AUTO_CALCULATE = "คำนวณอัตโนมัติ"
IDS_UCCO_FLG = "Flg"
IDS_UCCO_CHECK_TRANSVERSE_REBAR_AREA = "ตรวจสอบพื้นที่เหล็กเสริมตามขวาง"
IDS_UCCO_USE_DETAIL_HOOP_BAR_END = "ใช้รายละเอียดของเหล็กHoop Bar"
IDS_UCCO_INPUT_LIST = "รายการข้อมูลเสา SRC"
IDS_UCCO_LIMIT = "ขีดจำกัด"
IDS_UCCO_CHECK_REQUIREMENT_FOR_MATERIAL = "ตรวจสอบข้อกำหนดสำหรับวัสดุ"
IDS_UCCO_CALC_STEEL_RATIO = "คำนวณอัตราส่วนเหล็ก"
IDS_UCCO_CALC_MAIN_BAR_SPACE = "คำนวณระยะห่างของบาร์หลัก"
IDS_UCCO_CALC_CAPACITY_STEEL = "คำนวณความสามารถของเหล็ก"
IDS_USBP_CHECK_DEVELOPEMENT_LENGTH_ANCHOR_BOLT = "ตรวจสอบความยาวพัฒนาแรงของสลักเกลียวแองเคอร์"
IDS_USBP_BASE_PLATE = "แผ่นฐาน"
IDS_USBP_ANCHOR_BOLT = "สลักเกลียวยึด"
IDS_USBP_WING_PLATE = "แผ่นปีก"
IDS_USBP_RIB_PLATE = "แผ่นริบ"
IDS_USBP_RIB_WING_PLATE = "แผ่นริบ & แผ่นปีก"
IDS_USBP_PEDESTAL = "ฐานรอง"
IDS_USBP_CHECK_BEARING_STRESS_BASE_PLATE = "ตรวจสอบความเค้นกดแบริงของแผ่นฐาน"
IDS_USBP_REACTION_FORCE_NOT_EXIST = "ไม่มีแรงปฏิกิริยา"
IDS_USBP_BEARING_STRESS = "ความเค้นรองรับ"
IDS_USBP_BEARING_STRENGTH = "ความแข็งแรงรองรับ"
IDS_USBP_CALC_BEARING_STRESS_CONCRETE = "คำนวณความเค้นกดแบริงของคอนกรีต"
IDS_USBP_CALC_BEARING_STRENGTH_CONCRETE = "คำนวณกำลังรับแรงกดแบริงของคอนกรีต"
IDS_USBP_CHECK_TENSILE_STRENGTH = "ตรวจสอบความแข็งแรงดึง"
IDS_USBP_TENSION_FORCE_IS_NOT_EXIST = "ไม่มีแรงดึง"
IDS_USBP_CHECK_DEVELOPMENT_LENGTH = "ตรวจสอบความยาวการพัฒนา"
IDS_USBP_APPLIED_LCOM_BEARING_STRESS = "ชุดน้ำหนักบรรทุกที่นำมาใช้สำหรับความเค้นกดแบริง"
IDS_USBP_CHECK_TENSION_STRESS_ANCHOR_BOLT = "ตรวจสอบความเค้นดึงของสลักเกลียวแองเคอร์"
IDS_USBP_CHECK_TENSION_STRESS_BEARING = "ตรวจสอบความเค้นดึงในแบริง"
IDS_USBP_TENSION_FORCE_NOT_EXIST = "ไม่มีแรงดึง"
IDS_USBP_CHECK_BASE_PLATE = "ตรวจสอบแผ่นฐาน"
IDS_USBP_DESIGN_MOMENT_USE_AVERAGE = "โมเมนต์ออกแบบ"
IDS_USBP_FORCE_DIAGRAM = "แผนภาพแรง"
IDS_USBP_CHECK_RIB_PLATE = "ตรวจสอบแผ่นริบ"
IDS_USBP_CHECK_WING_PLATE = "ตรวจสอบแผ่นปีก"
IDS_USBP_CHECK_ANCHOR_BOLT_CIP = "ตรวจสอบสลักเกลียวยึด"
IDS_USBP_ANCHOR_BOLT_NOT_EXIST = "ไม่มีสลักเกลียวแองเคอร์"
IDS_USBP_CHECK_DEVELOP_LENGTH_ANCHOR_BOLT = "ตรวจสอบความยาวพัฒนาแรงของสลักเกลียวแองเคอร์"
IDS_USBP_INPUT_LIST = "รายการข้อมูลนำเข้าแผ่นฐานเหล็ก"
IDS_USBP_START_ANGLE = "มุมเริ่มต้น"
IDS_USBP_GENERATE_REPORT = "กำลังสร้างรายงานแผ่นฐานเหล็ก..."
IDS_USBP_CALC_BP_THK = "คำนวณความหนาแผ่นฐาน"
IDS_CALC_THK_RATIO = "คำนวณอัตราส่วนความหนาของแผ่นฐาน"
IDS_EC_UNLIMITED = "ไม่จำกัด"
IDS_ESMC_GENERATE_REPORT = "กำลังสร้างรายงานรอยต่อสลักเกลียวรับโมเมนต์..."
IDS_ESBC_GENERATE_REPORT = "กำลังสร้างรายงานรอยต่อสลักเกลียว..."
IDS_ESMC_ALONE = "เพียงลำพัง"
IDS_ESMC_AND = "และ"
IDS_ESMC_OR = "or"
IDS_ESMC_APPLIED = "นำไปใช้"
IDS_ESMC_AREA = "พื้นที่"
IDS_ESMC_BEAM = "คาน"
IDS_ESMC_BEAMFLANGEANDWEB = "คานปีกและเว็บ"
IDS_ESMC_BEAMFLANGEWEBCOMPRESISTANCE = "ปีกคานและเอวคาน กำลังต้านทานแรงอัด"
IDS_ESMC_BEAMFLANGEWEBINCOMPRESSION = "ปีกคานและเอวคานภายใต้กำลังต้านทานแรงอัด"
IDS_ESMC_BEAMWEB = "เว็บคาน"
IDS_ESMC_BEAMWEBINTRANSVERSETENSION = "เอวคานภายใต้แรงดึงตามขวาง"
IDS_ESMC_BOLT = "สลักเกลียว"
IDS_ESMC_BOLTBEARINGRESISTANCEATCOLUMNFLANGE = "กำลังต้านทานแรงกดแบริงของสลักเกลียวที่ปีกเสา"
IDS_ESMC_BOLTBEARINGRESISTANCEATENDPLATE = "กำลังต้านทานแรงกดแบริงของสลักเกลียวที่แผ่นปลาย"
IDS_ESMC_BOLTGROUP = "กลุ่มสลักเกลียว"
IDS_ESMC_BOLTINFORMATION = "ข้อมูลสลักเกลียว"
IDS_ESMC_BOLTINSHEAR = "สลักเกลียวในแรงเฉือน"
IDS_ESMC_BOLTROW = "แถวสลักเกลียว"
IDS_ESMC_BOLTSPACING = "ระยะห่างสลักเกลียว"
IDS_ESMC_BOLTSPACING_COLUMN = "ระยะห่างที่คอลัมน์"
IDS_ESMC_BOLTSPACING_PLATE = "ระยะห่างที่แผ่น"
IDS_ESMC_BOTTOMSTIFFENER = "ตัวเสริมด้านล่าง"
IDS_ESMC_BRACKET = "ขาแขวน"
IDS_ESMC_BUCKLINGCURVE = "เส้นโค้งการบิดเบือน"
IDS_ESMC_BUCKLINGRESISTANCE = "ความต้านทานการบิดเบือน"
IDS_ESMC_CALCULATEAXIALFORCEEQILIBRIUM = "สมดุลแรงแกน"
IDS_ESMC_CALCULATEDEPTH = "คำนวณความลึก"
IDS_ESMC_CALCULATEEFFECTIVELENGTH = "คำนวณความยาวที่มีประสิทธิภาพ"
IDS_ESMC_COLUMN = "เสา"
IDS_ESMC_COLUMNFLANGE = "ปีกเสา"
IDS_ESMC_COLUMNFLANGEINBENDING = "ปีกเสาในโมเมนต์ดัด"
IDS_ESMC_COLUMNWEB = "เว็บเสา"
IDS_ESMC_COLUMNWEBBUCKLINGRESISTANCE = "เว็บเสา, ความต้านทานการบิดเบือน"
IDS_ESMC_COLUMNWEBBUCKLINGRESISTANCEWITHCOMPRESSIONSTIFFENER = "เอวเสา กำลังต้านทานการโก่งเดาะพร้อมตัวเสริมกำลังรับแรงอัด"
IDS_ESMC_COLUMNWEBCRUSHINGRESISTANCE = "เว็บเสา, ความต้านทานการบด"
IDS_ESMC_COLUMNWEBCRUSHINGRESISTANCEWITHCOMPRESSIONSTIFFENER = "เอวเสา กำลังต้านทานการบดอัดพร้อมตัวเสริมกำลังรับแรงอัด"
IDS_ESMC_COLUMNWEBINTRANSVERSECOMPRESSION = "เอวเสาภายใต้แรงอัดตามขวาง"
IDS_ESMC_COLUMNWEBINTRANSVERSETENSION = "เอวเสาภายใต้แรงดึงตามขวาง"
IDS_ESMC_COLUMNWEBPANELINSHEAR = "เว็บเสาในแรงเฉือน"
IDS_ESMC_COLUMNWEBPANELZONE = "โซนแผงเว็บเสา"
IDS_ESMC_COLUMNWEBSTIFFENER = "ตัวเสริมเว็บเสา"
IDS_ESMC_COMBINED = "รวมกัน"
IDS_ESMC_COMPRESSIONGOVERNED = "ควบคุมด้วยแรงอัด"
IDS_ESMC_COMPRESSIONRESISTANCEOFCOLUMNWEBSHEAR = "เอวเสา กำลังต้านทานแรงเฉือนตามขวาง"
IDS_ESMC_COMPRESSIONSTIFFENERDIMENSIONS = "ขนาดตัวเสริมแรงอัด"
IDS_ESMC_COMPRESSIONZONE = "โซนแรงอัด"
IDS_ESMC_COMPRESSIVERESISTANCE = "ความต้านทานแรงอัด"
IDS_ESMC_CONNECTION = "การเชื่อมต่อ"
IDS_ESMC_DEPTH = "ความลึก"
IDS_ESMC_DEPTHABOVE600MM = "ความลึก > 600mm"
IDS_ESMC_DEPTHBELOW600MM = "ความลึก < 600mm"
IDS_ESMC_DESIGNFORCE = "แรงออกแบบ"
IDS_ESMC_DIA = "เส้นผ่านศูนย์กลาง"
IDS_ESMC_DOUBLE = "คู่"
IDS_ESMC_EDGEDISTANCE = "ระยะห่างขอบ"
IDS_ESMC_EFFECTIVEAREAOFSTIFFENERFORCRUSHING = "พื้นที่ใช้งานสำหรับการบดอัดพร้อมตัวเสริมกำลังรับแรงอัด"
IDS_ESMC_EFFECTIVEAREAOFSTIFFENERWITHWEBPORTION = "พื้นที่ใช้งานสำหรับการโก่งเดาะพร้อมตัวเสริมกำลังรับแรงอัด"
IDS_ESMC_EFFECTIVESTIFFENERSECTIONFORBUCKLING = "ตรวจสอบหน้าตัดใช้งานของตัวเสริมกำลังสำหรับการโก่งเดาะ"
IDS_ESMC_EFFECTIVETENSIONRESISTANCEOFBOLTROWS = "กำลังต้านทานแรงดึงใช้งานของแถวสลักเกลียว"
IDS_ESMC_EFFECTIVEWIDTHOFWEBINCOMPRESSION = "ความกว้างใช้งานของเอวภายใต้แรงอัด"
IDS_ESMC_EFFETIVESHEARRESISTANCE = "ความต้านทานแรงเฉือนที่มีประสิทธิภาพ"
IDS_ESMC_EFFRESISTANCE = "กำลังต้านทานใช้งาน"
IDS_ESMC_EN1993-1-1 = "EN 1993-1-1"
IDS_ESMC_EN1993-1-8 = "EN 1993-1-8"
IDS_ESMC_EN2-2-2 = "2.2(2)"
IDS_ESMC_EN3-2-1_1 = "3.2.1(1)"
IDS_ESMC_EN6-1_1 = "6.1(1)"
IDS_ESMC_EN6-2-6-1 = "6.2.6.1"
IDS_ESMC_EN6-2-6-2 = "6.2.6.2"
IDS_ESMC_EN6-2-6-3 = "6.2.6.3"
IDS_ESMC_EN6-2-6-7 = "6.2.6.7"
IDS_ESMC_EN6-2-6-8 = "6.2.6.8"
IDS_ESMC_EN6-2-7-2 = "6.2.7.2"
IDS_ESMC_EN6-2-7-2_7 = "6.2.7.2(7)"
IDS_ESMC_ENDPLATE = "แผ่นท้าย"
IDS_ESMC_ENDPLATEINBENDING = "แผ่นท้ายในโมเมนต์ดัด"
IDS_ESMC_ENMODE1 = "โหมด 1"
IDS_ESMC_ENMODE2 = "โหมด 2"
IDS_ESMC_ENMODE3 = "โหมด 3"
IDS_ESMC_ENP398 = "P398"
IDS_ESMC_ENSTEP5_WELDS = "STEP5 เชื่อม"
IDS_ESMC_ENSTEP6A_TENSIONSTIFFENER = "STEP6A ตัวเสริมแรงดึง"
IDS_ESMC_ENTABLE3-1 = "Table 3.1"
IDS_ESMC_ENTABLE3-4 = "Table 3.4"
IDS_ESMC_ENTABLE6-2 = "Table 6.2"
IDS_ESMC_ENTABLE6-2ETC = "Table 6.2, 6.4, 6.5, 6.6"
IDS_ESMC_ENTABLE6-4ETC = "Table 6.4, 6.5, 6.6"
IDS_ESMC_EQULIBRIUMOFFORCES = "สมดุลของแรง"
IDS_ESMC_GENERAL = "ทั่วไป"
IDS_ESMC_GIRDERFLANGERESISTANCE = "ความต้านทานปีกคาน"
IDS_ESMC_HAUNCH = "ส่วนยื่น"
IDS_ESMC_HAUNCHFLANGERESISTANCE = "ความต้านทานปีกส่วนยื่น"
IDS_ESMC_HAUNCHWEBRESISTANCE = "ความต้านทานเว็บส่วนยื่น"
IDS_ESMC_HOLEDIA = "เส้นผ่านศูนย์กลางรู"
IDS_ESMC_LAYOUT = "รูปแบบกลุ่มสลักเกลียว"
IDS_ESMC_LENGTH = "ความยาว"
IDS_ESMC_MODE1RESISTANCE = "ความต้านทานโหมด 1"
IDS_ESMC_MODE2RESISTANCE = "ความต้านทานโหมด 2"
IDS_ESMC_MODE3RESISTANCE = "ความต้านทานโหมด 3"
IDS_ESMC_MOMENTFORCEMINUS = "แถว 1 หมายถึงแถวล่างของกลุ่มสลักเกลียว"
IDS_ESMC_MOMENTFORCEPLUS = "แถว 1 หมายถึงแถวบนของกลุ่มสลักเกลียว"
IDS_ESMC_MOMENTRESISTANCE = "ความต้านทานโมเมนต์"
IDS_ESMC_MOMENTRESISTANCEWITHHAUNCH = "ความต้านทานโมเมนต์พร้อมฮอว์นช์"
IDS_ESMC_MOMENTRESISTANCEWITHOUTHAUNCH = "ความต้านทานโมเมนต์โดยไม่มีฮอว์นช์"
IDS_ESMC_NAME = "ชื่อ"
IDS_ESMC_NET = "สุทธิ"
IDS_ESMC_NOCOLUMNS = "จำนวนคอลัมน์"
IDS_ESMC_NOREDUCTION = "ไม่มีการลด"
IDS_ESMC_NOROWS = "จำนวนแถว"
IDS_ESMC_NOTAPPLIED = "ไม่ได้ใช้"
IDS_ESMC_NOTCHECK = "ไม่ตรวจสอบ"
IDS_ESMC_OK = "OK"
IDS_ESMC_PARTIALFACTOR_CONNECTION = "ปัจจัยบางส่วนของการเชื่อมต่อ"
IDS_ESMC_PARTIALFACTOR_STEEL = "ค่าสัมประสิทธิ์ย่อยของเหล็กโครงสร้าง"
IDS_ESMC_PLATE = "แผ่น"
IDS_ESMC_PLATEBUCKLINGREDUCTIONFACTOR = "ปัจจัยการลดการบิดเบือนแผ่น"
IDS_ESMC_PLATESLENDERNESS = "ความเพรียวของแผ่น"
IDS_ESMC_PRETENSION = "การดึงก่อน"
IDS_ESMC_REDUCTION = "การลด"
IDS_ESMC_REDUCTIONFACTORFORLONGITUDINALCOMPRESSIVESTRESS = "ค่าสัมประสิทธิ์ลดทอนสำหรับความเค้นอัดตามยาว"
IDS_ESMC_REDUCTIONFACTORFORSHEARINTERACTION = "ค่าสัมประสิทธิ์ลดทอนสำหรับปฏิสัมพันธ์ของแรงเฉือน"
IDS_ESMC_RESISTANCE = "ความต้านทาน"
IDS_ESMC_RESISTANCEOFCOLUMNFLANGEINBENDING = "กำลังต้านทานของปีกเสาในการดัด"
IDS_ESMC_RESISTANCEOFENDPLATEINBENDING = "กำลังต้านทานของแผ่นปลายในการดัด"
IDS_ESMC_RESISTANCEWITHHAUNCH = "ความต้านทานพร้อมฮอว์นช์"
IDS_ESMC_ROW = "แถว"
IDS_ESMC_SECTION = "หน้าตัด"
IDS_ESMC_SHEARREISTANCEOFSTIFFENEDWEB = "กำลังต้านทานแรงเฉือนของเอวที่มีตัวเสริมกำลัง"
IDS_ESMC_SHEARREISTANCEOFUNSTIFFENEDWEB = "กำลังต้านทานแรงเฉือนของเอวที่ไม่มีตัวเสริมกำลัง"
IDS_ESMC_SHEARRESISTANCE = "ความต้านทานแรงเฉือน"
IDS_ESMC_SPACING = "ระยะห่าง"
IDS_ESMC_STEEL = "เหล็กโครงสร้าง"
IDS_ESMC_STIFFENEDCOLUMNWEB = "ความต้านทานเว็บเสา"
IDS_ESMC_STIFFENERSIZE = "ขนาดของเสริมแรง"
IDS_ESMC_SUMMARYBOLTROW = "สรุป: แถวสลักเกลียว"
IDS_ESMC_SUMMARYMOMENTRESISTANCE = "สรุป: กำลังต้านทานโมเมนต์ดัด"
IDS_ESMC_SUMMARYRESISTANCEOFCOMPRESSIONZONE = "สรุป: กำลังต้านทานของเขตอัด"
IDS_ESMC_TENSIONGOVERNED = "ควบคุมโดยแรงดึง"
IDS_ESMC_TENSIONRESISTANCEOFBOLTROWS = "กำลังต้านทานแรงดึงของแถวสลักเกลียว"
IDS_ESMC_TENSIONSTIFFENERCHECK = "ตรวจสอบเสริมแรงแรงดึง"
IDS_ESMC_TENSIONSTIFFENERDIMENSIONS = "ขนาดเสริมแรงแรงดึง"
IDS_ESMC_TENSIONSTIFFENERNOREQUIRED = "ไม่จำเป็นต้องมีแผ่นเสริมกำลังรับแรงดึงสำหรับเอวเสา"
IDS_ESMC_TENSIONSTIFFENERREQUIRED = "จำเป็นต้องมีแผ่นเสริมกำลังรับแรงดึงสำหรับเอวเสา"
IDS_ESMC_TENSIONSTIFFENERRESISTANCE = "ความต้านทานเสริมแรงแรงดึง"
IDS_ESMC_TENSIONZONETSTUBS = "T-stubs โซนแรงดึง"
IDS_ESMC_THICKNESS = "ความหนา"
IDS_ESMC_TOPSTIFFENER = "เสริมแรงด้านบน"
IDS_ESMC_VERTICALSHEARRESISTANCE = "ความต้านทานแรงเฉือนแนวตั้ง"
IDS_ESMC_WEBRESISTANCE = "ความต้านทานเว็บ"
IDS_ESMC_WELDSCHECK = "ตรวจสอบการเชื่อม"
IDS_ESMC_WELDSIDES = "ด้านการเชื่อม"
IDS_ESMC_WIDTH = "ความกว้าง"
IDS_ESMC_WITHROW = "พร้อมแถว"
IDS_EC_FLANGE = "ฟลานจ์"
IDS_EC_WEB = "เว็บ"
IDS_EC_MEMBER_TYPE = "ประเภทเมมเบอร์"
IDS_EC_SECTION_PROPERTY = "คุณสมบัติหน้าตัด"
IDS_EC_BUILT_UP = "ประกอบขึ้น"
IDS_EC_ROLLED = "Rolled"
IDS_EC_CHK_ITEMS = "ตรวจสอบรายการ"
IDS_EC_MAJOR_AXIS_X = "แกนหลัก (X)"
IDS_EC_MINOR_AXIS_Y = "แกนรอง (Y)"
IDS_EC_REQUIRED = "จำเป็น"
IDS_EC_NO_REQUIRED = "ไม่จำเป็น"
IDS_EC_CLASS = "ประเภท"
IDS_EC_CLASS1 = "ประเภท 1"
IDS_EC_CLASS2 = "ประเภท 2"
IDS_EC_CLASS3 = "ประเภท 3"
IDS_EC_CLASS4 = "ประเภท 4"
IDS_EC_TABLE = "ตาราง"
IDS_ESSG_KIJ_ANNEX = "ภาคผนวกค่าสัมประสิทธิ์ปฏิสัมพันธ์"
IDS_ESSG_DETERMINATIO_INTERACTION_FACTOR = "การกำหนดค่าสัมประสิทธิ์ปฏิสัมพันธ์"
IDS_ESSG_METHOD_1_ANNEX_A = "ใช้วิธีที่ 1 ตามที่ระบุในภาคผนวก A"
IDS_ESSG_METHOD_2_ANNEX_B = "ใช้วิธีที่ 2 ตามที่ระบุในภาคผนวก B"
IDS_ESSG_CHK_AXIAL_RESISTANCE = "ตรวจสอบความต้านทานแกน"
IDS_ESSG_CALC_COMP_AXIAL_RESISTANCE = "คำนวณความต้านทานแกนการบีบอัด"
IDS_ESSG_CALC_TENS_AXIAL_RESISTANCE = "คำนวณความต้านทานแกนแรงดึง"
IDS_ESSG_CHK_SHEAR_RESISTANCE = "ตรวจสอบความต้านทานแรงเฉือน"
IDS_ESSG_CALC_SHEAR_RESISTANCE_MAJOR = "คำนวณกำลังต้านทานแรงเฉือนรอบแกนหลัก (y)"
IDS_ESSG_CALC_SHEAR_RESISTANCE_MINOR = "คำนวณกำลังต้านทานแรงเฉือนรอบแกนรอง (x)"
IDS_ESSG_APPLY_RIGID_END_POST = "ใช้ประเภทเสาปลายแบบแข็ง"
IDS_ESSG_APPLY_NON_RIGID_END_POST = "ใช้ประเภทเสาปลายแบบไม่แข็ง"
IDS_ESSG_CHK_MOMENT_RESISTANCE = "ตรวจสอบความต้านทานโมเมนต์"
IDS_ESSG_CALC_MOMENT_RESISTANCE_MAJOR = "คำนวณกำลังต้านทานโมเมนต์ดัดรอบแกนหลัก (x)"
IDS_ESSG_CALC_MOMENT_RESISTANCE_MINOR = "คำนวณกำลังต้านทานโมเมนต์ดัดรอบแกนรอง (y)"
IDS_ESSG_CHK_BENDING_SHEAR_RESISTANCE = "ตรวจสอบกำลังต้านทานโมเมนต์ดัดและแรงเฉือน"
IDS_ESSG_BENDING_SHEAR_RESISTANCE = "ความต้านทานการดัดและแรงเฉือน"
IDS_ESSG_CALC_BENDING_SHEAR_RESISTANCE_MAJOR = "คำนวณกำลังต้านทานโมเมนต์ดัดและแรงเฉือนรอบแกนหลัก"
IDS_ESSG_CALC_BENDING_SHEAR_RESISTANCE_MINOR = "คำนวณกำลังต้านทานโมเมนต์ดัดและแรงเฉือนรอบแกนรอง"
IDS_ESSG_CHK_BENDING_AXIAL_RESISTANCE = "ตรวจสอบกำลังต้านทานโมเมนต์ดัดและแรงตามแกน"
IDS_ESSG_BENDING_AXIAL_RESISTANCE = "ความต้านทานการดัดและแกน"
IDS_ESSG_CALC_BENDING_AXIAL_RESISTANCE = "คำนวณกำลังต้านทานโมเมนต์ดัดและแรงตามแกน"
IDS_ESSG_CHK_GENERAL_INTERACTION_RATIO = "ตรวจสอบอัตราส่วนการมีปฏิสัมพันธ์ทั่วไป"
IDS_ESSG_CHK_BENDING_SHEAR_AXIAL_RESISTANCE = "ตรวจสอบกำลังต้านทานโมเมนต์ดัด แรงเฉือน และแรงตามแกน"
IDS_ESSG_BENDING_SHEAR_AXIAL_RESISTANCE = "กำลังต้านทานโมเมนต์ดัด แรงเฉือน และแรงตามแกน"
IDS_ESSG_CALC_BENDING_SHEAR_AXIAL_RESISTANCE_MAJOR = "คำนวณกำลังต้านทานโมเมนต์ดัด แรงเฉือน และแรงตามแกนรอบแกนหลัก"
IDS_ESSG_CALC_BENDING_SHEAR_AXIAL_RESISTANCE_MINOR = "คำนวณกำลังต้านทานโมเมนต์ดัด แรงเฉือน และแรงตามแกนรอบแกนรอง"
IDS_ESSG_CHK_FBR_RESISTANCE = "ตรวจสอบความต้านทานการบิดเบือน"
IDS_ESSG_FBR_RESISTANCE = "ความต้านทานการบิดเบือน"
IDS_ESSG_CALC_FBR_RESISTANCE_MAJOR = "คำนวณกำลังต้านทานการวิบัติแบบโก่งเดาะดัดรอบแกนหลัก"
IDS_ESSG_CALC_FBR_RESISTANCE_MINOR = "คำนวณกำลังต้านทานการวิบัติแบบโก่งเดาะดัดรอบแกนรอง"
IDS_ESSG_CHK_TB_TFB_RESISTANCE = "ตรวจสอบการโก่งเดาะแบบบิดและบิด-ดัด"
IDS_ESSG_TB_TFB_RESISTANCE = "การโก่งเดาะแบบบิดและบิด-ดัด"
IDS_ESSG_CALC_TB_RESISTANCE = "คำนวณความต้านทานการบิดเบือน"
IDS_ESSG_CALC_TFB_RESISTANCE = "คำนวณกำลังต้านทานการโก่งเดาะแบบบิด-ดัด"
IDS_ESSG_CHK_LTB_RESISTANCE = "ตรวจสอบกำลังต้านทานการโก่งเดาะบิดด้านข้าง"
IDS_ESSG_LTB_RESISTANCE = "ความต้านทานการบิดเบือนด้านข้าง"
IDS_ESSG_CALC_LTB_RESISTANCE = "คำนวณกำลังต้านทานการโก่งเดาะบิดด้านข้าง"
IDS_ESSG_CHK_BNC_RESISTANCE = "ตรวจสอบเมมเบอร์สม่ำเสมอภายใต้โมเมนต์ดัดและแรงอัดตามแกน"
IDS_ESSG_BNC_RESISTANCE = "เมมเบอร์สม่ำเสมอภายใต้โมเมนต์ดัดและแรงอัดตามแกน"
IDS_ESSG_CALC_BNC_RESISTANCE = "คำนวณกำลังต้านทานของเมมเบอร์สม่ำเสมอภายใต้โมเมนต์ดัดและแรงอัดตามแกน"
IDS_ESSG_CHK_SHEAR_BUCKLING_RESISTANCE = "ตรวจสอบความต้านทานการบิดเบือนแรงเฉือน"
IDS_ESSG_SHEAR_BUCKLING_RESISTANCE = "ความต้านทานการบิดเบือนแรงเฉือน"
IDS_ESSG_CALC_SHEAR_BUCKLING_MAJOR = "คำนวณกำลังต้านทานการโก่งเดาะแรงเฉือนรอบแกนหลัก"
IDS_ESSG_CALC_SHEAR_BUCKLING_MINOR = "คำนวณกำลังต้านทานการโก่งเดาะแรงเฉือนรอบแกนรอง"
IDS_ESSG_HIGH_SHAER = "แรงเฉือนสูง"
IDS_ESSG_NOT_HIGH_SHAER = "ไม่ใช่แรงเฉือนสูง"
IDS_ESSG_NEGLECT_EFFECT_ON_MOMNET_RESISTANCE = "ละเลยผลกระทบต่อกำลังต้านทานโมเมนต์ดัด"
IDS_ESSG_NO_REQUIRED_REDUCE_FOLLOWING_CONDITION = "ไม่จำเป็นต้องลดภายใต้เงื่อนไขต่อไปนี้"
IDS_ESSG_NO_REQUIRED_REDUCE_B_FOLLOWING_CONDITION = "ไม่จำเป็นต้องลดกำลังต้านทานโมเมนต์ดัดภายใต้เงื่อนไขต่อไปนี้"
IDS_ESSG_NO_REQUIRED_REDUCE_B_A_FOLLOWING_CONDITION = "ไม่จำเป็นต้องลดกำลังต้านทานโมเมนต์ดัดและแรงตามแกนภายใต้เงื่อนไขต่อไปนี้"
IDS_ESSG_NO_REQUIRED_REDUCE_B_A_FOLLOWING_CONDITION_MINOR_AXIS = "ไม่จำเป็นต้องลดเงื่อนไขกำลังต้านทานโมเมนต์ดัดและแรงตามแกนสำหรับแกนรองภายใต้เงื่อนไขต่อไปนี้"
IDS_ESSG_NO_REQUIRED_REDUCE_B_A_FOLLOWING_CONDITION_MAJOR_AXIS = "ไม่จำเป็นต้องลดเงื่อนไขกำลังต้านทานโมเมนต์ดัดและแรงตามแกนสำหรับแกนหลักภายใต้เงื่อนไขต่อไปนี้"
IDS_ESSG_ALLOWANCE_FOR_EFFECT_ON_MAJOR_AND_MINOR_AXIS = "การพิจารณาผลของแรงตามแกนต่อแกนหลักและแกนรองภายใต้เงื่อนไขต่อไปนี้ "
IDS_ESSG_BUCKLING_CURVE = "เส้นโค้งการบิดเบือน"
IDS_ESSG_LATERAL_TORSIONAL_BUCKLING_CURVE = "เส้นโค้งการบิดเบือนด้านข้าง"
IDS_ESSG_LATERAL_TORSIONAL_N_BUCKLING_CURVE = "เส้นโค้งการบิดเบือนด้านข้าง\n"
IDS_ESSG_NO_REQUIRED_TO_CHK_FBR = "ไม่จำเป็นต้องตรวจสอบกำลังต้านทานการโก่งเดาะ"
IDS_ESSG_NO_REQUIRED_TO_CHK_TFB = "ไม่จำเป็นต้องตรวจสอบการโก่งเดาะแบบบิดและบิด-ดัด"
IDS_ESSG_NO_REQUIRED_TO_CHK_LTB = "ไม่จำเป็นต้องตรวจสอบการโก่งเดาะบิดด้านข้าง"
IDS_ESSG_NO_REQUIRED_TO_CHK_BNC = "ไม่จำเป็นต้องตรวจสอบกำลังต้านทานโมเมนต์ดัดและแรงอัดตามแกน"
IDS_ESSG_NO_REQUIRED_TO_CHK_SHEARBUCK = "ไม่จำเป็นต้องตรวจสอบการโก่งเดาะแรงเฉือน"
IDS_ESSG_BUCKLING_EFFECT_MAY_BE_IGNORED = "สามารถละเลยผลของการโก่งเดาะได้"
IDS_ESSG_BUCKLING_EFFECT_SHOULD_BE_CONSIDERD = "ควรพิจารณาผลของการโก่งเดาะ"
IDS_ESSG_NO_CALCULATED_BY_ANNEX_A = "คำนวณโดยภาคผนวก A"
IDS_ESSG_NO_CALCULATED_BY_ANNEX_B = "คำนวณโดยภาคผนวก B"
IDS_ADDITIONAL_BEARING_WIDTH_EN1993_1_8_CL626 = "ความกว้างรับแรงกดเพิ่ม (EN1993-1-8 cl6.2.6)"
IDS_ANCHOR_BOLT_BEARING_RESISTANCE = "ความต้านทานการรับน้ำหนักสลักเกลียว"
IDS_ANCHOR_BOLT_FRICTION_RESISTANCE = "ความต้านทานแรงเสียดทานสลักเกลียว"
IDS_ANCHOR_BOLT_SHEAR_PROPERTIES = "คุณสมบัติแรงเฉือนของสลักเกลียว"
IDS_ANCHOR_BOLT_TENSILE_RESISTANCE = "ความต้านทานแรงดึงของสลักเกลียว"
IDS_ASSEMBLYSTRONG_AXIS = "การประกอบ(แกนแข็ง)"
IDS_ASSEMBLYWEAK_AXIS = "การประกอบ(แกนอ่อน)"
IDS_BASE_PLATE_AND_ANCHOR_BOLT_PROPERTIES = "คุณสมบัติของแผ่นฐานและสลักเกลียวแองเคอร์"
IDS_BASE_PLATE_IN_BENDING_AND_ANCHOR_BOL_IN_TENS_S = "แผ่นฐานภายใต้โมเมนต์ดัด และสลักเกลียวแองเคอร์ภายใต้แรงดึง (แกนแข็ง)"
IDS_BASE_PLATE_IN_BENDING_AND_ANCHOR_BOL_IN_TENS_W = "แผ่นฐานภายใต้โมเมนต์ดัด และสลักเกลียวแองเคอร์ภายใต้แรงดึง (แกนอ่อน)"
IDS_BASE_PLATE_IN_BENDING_AND_CONCRETE_IN_COMPRE_S = "แผ่นฐานภายใต้โมเมนต์ดัด และคอนกรีตภายใต้แรงอัด (แกนแข็ง)"
IDS_BASE_PLATE_IN_BENDING_AND_CONCRETE_IN_COMPRE_W = "แผ่นฐานภายใต้โมเมนต์ดัด และคอนกรีตภายใต้แรงอัด (แกนอ่อน)"
IDS_BASE_PLATE_RESISTANCE_IN_COMPRESSION = "กำลังต้านทานของแผ่นฐานภายใต้แรงอัด"
IDS_BASE_PLATE_RESISTANCE_IN_TENSION = "กำลังต้านทานของแผ่นฐานภายใต้แรงดึง"
IDS_BEARING_STRENGTHEN1993_1_8_CL625_ = "กำลังรับแรงกด (EN1993-1-8 cl6.2.5) "
IDS_BTR = "BTR"
IDS_CALCULATION_OF_EFFECTIVE_LENGTH = "การคำนวณความยาวที่มีประสิทธิภาพ"
IDS_CALCULATION_OF_EFFECTIVE_LENGTH_EN1993_1_8_626 = "การคำนวณความยาวประสิทธิผล (EN1993-1-8 6.2.6.4)"
IDS_CALCULATION_OF_EFFECTIVE_LENGTH_INNER_BOLTS = "การคำนวณความยาวประสิทธิผล (สลักเกลียวด้านใน)"
IDS_CALCULATION_OF_EFFECTIVE_LENGTH_OUTER_BOLTS = "การคำนวณความยาวประสิทธิผล (สลักเกลียวด้านนอก)"
IDS_CALCULATION_OF_JOINT_RESISTANCE = "การคำนวณความต้านทานของจุดเชื่อม"
IDS_CHECK_BOLT_SHEAR = "ตรวจสอบแรงเฉือนของสลักเกลียว"
IDS_CHECK_BOLT_TENSION = "ตรวจสอบแรงดึงของสลักเกลียว"
IDS_CHECK_COMBINED_SHEAR_AND_TORSION = "ตรวจสอบแรงเฉือนและโมเมนต์บิดร่วมกัน"
IDS_CHECK_FOR_NO_OVERLAP_CONDITION = "ตรวจสอบเงื่อนไขไม่มีการซ้อนทับ"
IDS_CHECK_FOR_PRYING_CONDITION = "ตรวจสอบสภาพการดึง"
IDS_CHECK_IF_EFFECTIVE_AREA_FITS_ON_THE_BASE_PLATE = "ตรวจสอบว่าพื้นที่ประสิทธิผลพอดีกับแผ่นฐานหรือไม่"
IDS_COMLUMNFLANGE_AND_WEB_IN_COMPRESSIONSTRONG_AXI = "เสา ปีก และเอว ภายใต้แรงอัด (แกนแข็ง)"
IDS_COMPRESSED_PART_RESISTANCE = "ความต้านทานของส่วนที่ถูกบีบอัด"
IDS_COMPRESSIVE_CAPACITY_CALCULATIONSTRONG_AXIS = "การคำนวณกำลังรับแรงอัด (แกนแข็ง)"
IDS_COMPRESSIVE_RESISTANCE_CALCULATION = "การคำนวณความต้านทานการบีบอัด"
IDS_COMPRESSIVE_RESISTANCE_CHECK = "ตรวจสอบความต้านทานการบีบอัด"
IDS_CORRELATION_FACTOR_FOR_FILLET_WELD = "ค่าสัมประสิทธิ์สหสัมพันธ์สำหรับรอยเชื่อมฟิลเลต"
IDS_DESIGN_ANCHOR_BOLT_RESISTANCE = "การออกแบบความต้านทานสลักเกลียว"
IDS_DESIGN_BOND_ANCHORAGE_RESISTANCE = "การออกแบบความต้านทานการยึดติด"
IDS_DESIGN_CASE__LEFT_SIDE_IN_COMPRESSION_RIGHT_S = "กรณีออกแบบ: ด้านซ้ายรับแรงอัด ด้านขวารับแรงอัด"
IDS_DESIGN_CASE__LEFT_SIDE_IN_TENSION_RIGHT_SIDE_ = "กรณีออกแบบ: ด้านซ้ายรับแรงดึง ด้านขวารับแรงดึง"
IDS_DESIGN_COMPRESSION_RESISTANCE_OF_FLANGE = "กำลังต้านทานแรงอัดออกแบบของปีก"
IDS_DESIGN_MOMENT_RESISTANCE_OF_COLUMN_BASE = "กำลังต้านทานโมเมนต์ดัดออกแบบของฐานเสา"
IDS_DESIGN_SHEAR_RESISTANCE_FOR_FILLET_WELD_IN_X_D = "กำลังต้านทานแรงเฉือนออกแบบสำหรับรอยเชื่อมฟิลเลตในทิศทาง X"
IDS_DESIGN_SHEAR_RESISTANCE_FOR_FILLET_WELD_IN_Y_D = "กำลังต้านทานแรงเฉือนออกแบบสำหรับรอยเชื่อมฟิลเลตในทิศทาง Y"
IDS_DESIGN_TENSILE_RESISTANCE_FOR_FILLET_WELD = "กำลังต้านทานแรงดึงออกแบบสำหรับรอยเชื่อมฟิลเลต"
IDS_EFFECTIVE_AREA_CALCULATION = "การคำนวณพื้นที่ที่มีประสิทธิภาพ"
IDS_EFFECTIVE_AREA_FROM_FORCE_EQUILIBRIUM_EN1993_1 = "พื้นที่ประสิทธิผลจากสมดุลของแรง (EN1993-1-8 Cl.6.2.5)"
IDS_EFFECTIVE_AREA_OF_COMPRESSED_T_STUB = "พื้นที่ประสิทธิผลของ T-Stub ที่ถูกอัด"
IDS_EFFECTIVE_LENGTHWIDTH_AND_AREA = "ความยาวประสิทธิผล ความกว้าง และพื้นที่"
IDS_EQUIVALENT_FORCE_CALCULATION_COLUMN_FLANGE = "การคำนวณแรงสมมูล (ปีกเสา)"
IDS_EQUIVALENT_FORCE_CALCULATION_T_STUB = "การคำนวณแรงสมมูล (T-Stub)"
IDS_FACTOR_M_FOR_OUTER_BOLTS = "ตัวประกอบ m สำหรับสลักเกลียวด้านนอก"
IDS_GROUT_INFLUENCING_CONCRETE_BEARING_RESISTANCE = "เกร้าท์มีผลต่อกำลังต้านทานแรงกดของคอนกรีต"
IDS_GROUT_NOT_INFLUENCING_CONCRETE_BEARING_RESISTA = "เกร้าท์ไม่มีผลต่อกำลังต้านทานแรงกดของคอนกรีต"
IDS_LEAVER_ARM_OF_COMPRESSION_PART = "แขนโมเมนต์ของส่วนรับแรงอัด"
IDS_LEAVER_ARM_OF_TENSION_PART = "แขนโมเมนต์ของส่วนรับแรงดึง"
IDS_LOAD_ECCENTRICITY = "ความเบี่ยงเบนของน้ำหนัก"
IDS_MOMENT_CAPACITY = "ความจุโมเมนต์"
IDS_NO = "No"
IDS_NOX = "ไม่(X)"
IDS_NOY = "ไม่(Y)"
IDS_PLASTIC_BENDING_MOMENT_CAPACITY_OF_BASE_PLATE = "กำลังรับโมเมนต์ดัดพลาสติกของแผ่นฐาน"
IDS_PLASTIC_BENDING_MOMENT_CAPACITY_OF_BASE_PLATE_ = "กำลังรับโมเมนต์ดัดพลาสติกของแผ่นฐานต่อหน่วยความยาว"
IDS_PLASTIC_BENDING_MOMENT_CAPACITY_OF_THE_COLUMN = "กำลังรับโมเมนต์ดัดพลาสติกของเสา"
IDS_PRESENCE_OF_PRYING_EFFECT = "การมีอยู่ของผลกระทบการดึง"
IDS_RATIOX = "อัตราส่วน(x)"
IDS_RATIOY = "อัตราส่วน(y)"
IDS_REDUCING_MOMENT_CAPACITY_EN1993_1_16282_ = "การลดกำลังรับโมเมนต์ดัด (EN1993-1-1,6.2.8(2) "
IDS_REDUCING_MOMENT_CAPACITY_EN1993_1_162914__629 = "การลดกำลังรับโมเมนต์ดัด (EN1993-1-1,6.2.9.1(4) & 6.2.9.1(5)"
IDS_RESISTANCE_OF_FAILURE_MODE_1 = "กำลังต้านทานของโหมดวิบัติ 1"
IDS_RESISTANCE_OF_FAILURE_MODE_1_2 = "กำลังต้านทานของโหมดวิบัติ 1-2"
IDS_RESISTANCE_OF_FAILURE_MODE_2 = "กำลังต้านทานของโหมดวิบัติ 2"
IDS_RESISTANCE_OF_FAILURE_MODE_3 = "กำลังต้านทานของโหมดวิบัติ 3"
IDS_RESISTANCE_OF_FAILURE_MODE_4COLUMN_WEB_IN_TENS = "กำลังต้านทานของโหมดวิบัติ 4 (เอวเสาภายใต้แรงดึง) "
IDS_RESISTANCE_OF_T_STUB_FAILURE_MODE_1_2EN1993_1_ = "กำลังต้านทานของ T-Stub โหมดวิบัติ 1-2 (EN1993-1-8 Cl.6.2.4.1)"
IDS_RESISTANCE_OF_T_STUB_IN_TENSION = "กำลังต้านทานของ T-Stub ภายใต้แรงดึง"
IDS_RESISTANCE_OF_TENSION_T_STUB = "กำลังต้านทานของ T-Stub ภายใต้แรงดึง"
IDS_RIB = "ริบ"
IDS_SHEAR_DESIGNEN1993_1_8_TABLE_34 = "การออกแบบแรงเฉือน (EN1993-1-8 Table 3.4)"
IDS_SHEAR_FORCE_NOT_EXIST = "ไม่มีแรงเฉือน"
IDS_T = "t"
IDS_TENSION_FORCES = "แรงดึง"
IDS_TENSION_PART_RESISTANCE_VERIFICATION = "การตรวจสอบความต้านทานส่วนแรงดึง"
IDS_TENSION_RESISTANCE_FACTORS = "ปัจจัยความต้านทานแรงดึง"
IDS_TENSION_RESISTANCE_OF_BOLTS = "ความต้านทานแรงดึงของน็อต"
IDS_WELDING_CHECK_EN_1993_1_8_CL4533 = "การตรวจสอบงานเชื่อม (EN 1993-1-8 Cl.4.5.3.3)"
IDS_WELDING_RATIO = "อัตราส่วนการเชื่อม"
IDS_WIDTH_OF_STRIP_AROUND_COLUMN_C_S_EN1993_1_8_CL = "ความกว้างของแถบรอบเสา C/S (EN1993-1-8 cl6.2.6)"
IDS_WING = "ปีก"
IDS_CHECK_EDGE_DISTANCE_POST_INSTALLED_ANCHOR_BOLT = "ตรวจสอบระยะจากขอบ (สลักเกลียวแองเคอร์แบบติดตั้งภายหลัง)"
IDS_CALCULATE_TENSILE_STRENGTH_POST_INSTALLED_ANCHOR_BOLT = "คำนวณกำลังรับแรงดึง (สลักเกลียวแองเคอร์แบบติดตั้งภายหลัง)"
IDS_CALCULATE_SHEAR_STRENGTH_POST_INSTALLED_ANCHOR_BOLT = "คำนวณกำลังรับแรงเฉือน (สลักเกลียวแองเคอร์แบบติดตั้งภายหลัง)"
IDS_CHECK_DISTANCE_FROM_CONCRETE_EDGE_TO_CENTER_OF_ANCHOR_BOLT = "ตรวจสอบระยะจากขอบคอนกรีตถึงศูนย์กลางของสลักเกลียวแองเคอร์"
IDS_CALCULATE_STRENGTH_OF_STEEL = "คำนวณความแข็งแรงของเหล็ก"
IDS_CALCULATE_SIZE_DATA = "คำนวณข้อมูลขนาด"
IDS_CALCULATE_CONCRETE_BREAK_OUT_STRENGTH = "คำนวณกำลังรับแรงวิบัติแบบแตกหลุดของคอนกรีต"
IDS_CALCULATE_PULL_OUT_STRENGTH_OF_ANCHOR = "คำนวณกำลังรับแรงดึงหลุดของแองเคอร์"
IDS_CONCRETE_BREAK_OUT_STRENGTH_DIRECTION_X = "กำลังรับแรงวิบัติแบบแตกหลุดของคอนกรีต, ทิศทาง X"
IDS_CONCRETE_BREAK_OUT_STRENGTH_DIRECTION_Y = "กำลังรับแรงวิบัติแบบแตกหลุดของคอนกรีต, ทิศทาง Y"
IDS_CALCULATE_CONCRETE_PRY_OUT_STRENGTH = "คำนวณกำลังรับแรงงัดหลุดของคอนกรีต"
IDS_CALCULATE_COMBINED_RATIO = "คำนวณอัตราส่วนรวม"
IDS_CONDITION = "เงื่อนไข"
IDS_EQUATION = "สมการ"
IDS_RC_ANCHOR_BOLT_INPUT_LIST = "รายการข้อมูลนำเข้า RC ANCHOR BOLT"
IDS_CHECK_FLANGE_AND_WEB_UNDER_CONCENTRATED_FORCE = "ตรวจสอบปีกและเอวภายใต้แรงกระทำแบบรวมศูนย์"
IDS_CHECK_IF_STIFFENER_IS_REQUIRED = "ตรวจสอบว่าจำเป็นต้องมีแผ่นเสริมกำลังหรือไม่"
IDS_CHECK_REQUIREMENT_FOR_STIFFENER = "ตรวจสอบความต้องการสำหรับสติเฟนเนอร์"
IDS_CHECK_REQUIREMENT_FOR_TENSION_FIELD_ACTION = "ตรวจสอบข้อกำหนดสำหรับการทำงานแบบสนามแรงดึง"
IDS_CHECK_REQUIREMENT_FOR_STIFFENER_TO_APPLY_TENSION_FIELD_ACTION = "ตรวจสอบข้อกำหนดของแผ่นเสริมกำลังเพื่อให้เกิดการทำงานแบบสนามแรงดึง"
IDS_CHECK_WEB_UNDER_CONCENTRATED_FORCE = "ตรวจสอบเอวภายใต้แรงกระทำแบบรวมศูนย์"
IDS_COLUMNS = "เสา"
IDS_UNIFORM_LOAD = "น้ำหนักบรรทุกสม่ำเสมอ"
IDS_FINISH_LOAD = "น้ำหนักบรรทุกสุดท้าย"
IDS_CONSTRUCTION_LOAD = "น้ำหนักบรรทุกในการก่อสร้าง"
IDS_CONSTRUCTION_STAGE = "ขั้นตอนการก่อสร้าง"
IDS_CHECK_REQUIREMENT_FOR_STUD = "ตรวจสอบความต้องการสำหรับสตัด"
IDS_CHECK_SIZE = "ตรวจสอบขนาด"
IDS_CHECK_MATERIAL = "ตรวจสอบวัสดุ"
IDS_MATERIAL_PROPERTIES_APPLIED = "คุณสมบัติของวัสดุ (ที่ใช้)"
IDS_CALCULATE_EFFECTIVE_WIDTH_OF_SLAB = "คำนวณความกว้างประสิทธิผลของพื้น"
IDS_EFFECTIVE_WIDTH_OF_SLAB = "ความกว้างที่มีประสิทธิภาพของพื้น"
IDS_THICKNESS_OF_CONCRETE = "ความหนาของคอนกรีต"
IDS_CALCULATE_DESIGN_SHEAR_FORCE = "คำนวณแรงเฉือนออกแบบ"
IDS_CALCULATE_DESIGN_FORCE_DURING_CONSTRUCTION = "คำนวณแรงออกแบบระหว่างการก่อสร้าง"
IDS_CHECK_DEFLECTION_DURING_CONSTRUCTION = "ตรวจสอบการดัดในระหว่างการก่อสร้าง"
IDS_CHECK_DEFLECTION_BY_DEAD_LOAD = "ตรวจสอบการโก่งตัวจากน้ำหนักบรรทุกคงที่"
IDS_CHECK_DEFLECTION_BY_LIVE_LOAD = "ตรวจสอบการโก่งตัวจากน้ำหนักบรรทุกจร"
IDS_CALCULATE_STRENGTH_OF_STUD = "คำนวณความแข็งแรงของสตัด"
IDS_CALCULATE_ELASTIC_MODULUS_OF_CONCRETE = "คำนวณมอดูลัสยืดหยุ่นของคอนกรีต"
IDS_CALCULATE_NUMBER_OF_STUD = "คำนวณจำนวนสตัด"
IDS_CALCULATE_COMPOSITION_RATIO = "คำนวณอัตราส่วนผสม"
IDS_CHECK_MOMENT_STRENGTH_POSITIVE_MOMENT = "ตรวจสอบกำลังรับโมเมนต์ดัด (โมเมนต์บวก)"
IDS_CALCULATE_MOMENT_OF_INERTIA = "คำนวณโมเมนต์ของความเฉื่อย"
IDS_CALCULATE_EFFECTIVE_MOMENT_OF_INERTIA = "คำนวณโมเมนต์ความเฉื่อยประสิทธิผล"
IDS_CALCULATE_LOWER_LIMIT_FOR_MOMENT_OF_INERTIA = "คำนวณขีดจำกัดล่างของโมเมนต์ความเฉื่อย"
IDS_CALCULATE_BEAM_MODE_PROPERTIES = "คำนวณคุณสมบัติของโหมดคาน"
IDS_CALCULATE_EFFECTIVE_WIDTH = "คำนวณความกว้างที่มีประสิทธิภาพ"
IDS_CALCULATE_TRANSFORMED_MOMENT_OF_INERTIA = "คำนวณโมเมนต์ความเฉื่อยเทียบเท่า"
IDS_CALCULATE_DEFLECTION__FREQUENCY = "คำนวณการดัด & ความถี่"
IDS_CALCULATE_TRANSFORMED_MOMENT_OF_INERTIA_PER_UNIT_WIDTH = "คำนวณโมเมนต์ความเฉื่อยเทียบเท่าต่อความกว้างหนึ่งหน่วย"
IDS_CALCULATE_EFFECTIVE_BEAM_PANEL_WIDTH = "คำนวณความกว้างประสิทธิผลของแผงคาน"
IDS_CALCULATE_WEIGHT_OF_BEAM_PANEL = "คำนวณน้ำหนักของแผงคาน"
IDS_CALCULATE_GIRDER_MODE_PROPERTIES = "คำนวณคุณสมบัติของโหมดคานยาว"
IDS_CALCULATE_EFFECTIVE_GIRDER_PANEL_WIDTH = "คำนวณความกว้างประสิทธิผลของแผงคานหลัก"
IDS_CHECK_VIBRATION_COMBINED_MODE = "ตรวจสอบการสั่นสะเทือน (โหมดรวม)"
IDS_ADJUST_GIRDER_DEFLECTION = "ปรับการดัดของคานยาว"
IDS_CALCULATE_FLOOR_FUNDAMENTAL_FREQUENCY = "คำนวณความถี่พื้นฐานของพื้น"
IDS_CALCULATE_EQUIVALENT_COMBINED_MODE_PANEL_WEIGHT = "คำนวณน้ำหนักแผงแบบโหมดรวมเทียบเท่า"
IDS_CALCULATE_PEAK_ACCELERATION = "คำนวณความเร่งสูงสุด"
IDS_H_BEAM__SLAB = "H-Beam & พื้น"
IDS_CONST_LOAD = "น้ำหนักบรรทุกคงที่ (ก่อสร้าง)"
IDS_CONCENTRATED_FORCES = "แรงที่รวมกัน"
IDS_CONSTRUCTION = "การก่อสร้าง"
IDS_DEAD__LIVE = "น้ำหนักตาย & น้ำหนักมีชีวิต"
IDS_PLASTIC_DESIGN_COMPACT_SECTION = "การออกแบบพลาสติก (หน้าตัดกะทัดรัด)"
IDS_ELASTIC_DESIGN_COMPACT_SECTION = "การออกแบบแบบยืดหยุ่น (หน้าตัดไม่กะทัดรัด)"
IDS_MAX = "ค่าสูงสุด"
IDS_V = "V'"
IDS_COMP_RATIO = "อัตราส่วนการอัด"
IDS_N = "n"
IDS_CALCULATE_EFFECTIVE_BEAM_PANEL_WIDTH__WEIGHT = "คำนวณความกว้างประสิทธิผลและน้ำหนักของแผงคาน"
IDS_CALCULATE_EFFECTIVE_GIRDER_PANEL_WIDTH__WEIGHT = "คำนวณความกว้างประสิทธิผลและน้ำหนักของแผงคานหลัก"
IDS_W = "W"
IDS_FLOOR_FREQUENCY_HZ = "ความถี่พื้น (Hz)"
IDS_PEAK_ACCELERATION_%_GRAVITY = "Peak Acceleration (% Gravity)"
IDS_SRC_COMPOSITE_BEAM_INPUT_LIST = "รายการข้อมูลนำเข้า SRC COMPOSITE BEAM"
IDS_SECTION_H_BEAM__SLAB = "หน้าตัด (H-Beam & พื้น)"
IDS_SECTION_STUD = "หน้าตัด (สตัด)"
IDS_SECTION_DECK_PLATE = "หน้าตัด (แผ่นดาด)"
IDS_DESIGN_LOAD_UNIFORM_LOAD = "น้ำหนักบรรทุกออกแบบ (น้ำหนักบรรทุกสม่ำเสมอ)"
IDS_DESIGN_FORCE_CONCENTRATED_FORCES = "แรงออกแบบ (แรงที่รวมกัน)"
IDS_NOWEB = "ไม่มีเอว"
IDS_NOFLANGE = "ไม่มีปีก"
IDS_PM = "PM"
IDS_VX = "Vx"
IDS_VY = "Vy"
IDS_C = "C"
IDS_D = "D"
IDS_HOOP_BAR = "บาร์โฮป"
IDS_CHECK_REQUIREMENT_FOR_MATERIAL = "ตรวจสอบความต้องการสำหรับวัสดุ"
IDS_CALCULATE_STEEL_RATIO = "คำนวณอัตราส่วนเหล็ก"
IDS_CALCULATE_MAIN_BAR_SPACE = "คำนวณระยะห่างบาร์หลัก"
IDS_CALCULATE_ECCENTRICITY = "คำนวณความเบี่ยงเบน"
IDS_COLUMN_UNDER_TENSION_FORCE_SKIPPED = "เสาอยู่ภายใต้แรงดึง ข้ามการคำนวณ"
IDS_CALCULATE_CAPACITY_OF_STEEL = "คำนวณความจุของเหล็ก"
IDS_CALCULATE_NOMINAL_CAPACITY_FOR_NEUTRAL_AXIS = "คำนวณกำลังรับน้ำหนักตามนามสำหรับแกนเป็นกลาง"
IDS_F = "f"
IDS_CONC = "คอนกรีต"
IDS_STEEL = "เหล็ก"
IDS_CONCRETE_SECTION = "หน้าตัดคอนกรีต"
IDS_H_BEAM__REBAR = "H-Beam & เหล็กเสริม"
IDS_HOOP_BAREND = "บาร์โฮป(ปลาย)"
IDS_STEEL_BEAM_AT_CONSTRUCTION_STAGE = "คานเหล็กในขั้นตอนการก่อสร้าง"
IDS_COMPOSITE_BEAM_AT_NORMAL_STAGE = "คานคอมโพสิตในสภาวะปกติ"
IDS_CHECK_NEUTRAL_AXIS_IN_SECTION = "ตรวจสอบแกนเป็นกลางในหน้าตัด"
IDS_PLASTIC_NA = "N.A. แบบพลาสติก"
IDS_COORINATE_OF_PLASTIC_NA = "พิกัดของ N.A. แบบพลาสติก"
IDS_CHECK_BENDING_RESISTANCE = "ตรวจสอบความต้านทานการดัด"
IDS_NAXIS_CONDITION = "เงื่อนไข"
IDS_NAXIS_EQUATION_FOR = "สมการสำหรับ"
IDS_NAXIS_VALUE = "ค่า"
IDS_CALCULATION = "การคำนวณ"
IDS_CALCULATION_FOR_K = "การคำนวณสำหรับ k"
IDS_ELASTIC_MOMENT_RESISTANCE = "การคำนวณความต้านทานโมเมนต์ดัดแบบยืดหยุ่น"
IDS_PLASTIC_MOMENT_RESISTNACE = "การคำนวณความต้านทานโมเมนต์ดัดแบบพลาสติก"
IDS_CALCULATION_OF = "การคำนวณของ"
IDS_ELASTIC_NA = "N.A. แบบยืดหยุ่น"
IDS_COORDINATE_OF_ELASTIC_NA = "พิกัดของ N.A. แบบยืดหยุ่น"
IDS_CHECK_EFFECTIVE_COMPOSTIE_SECTION = "ตรวจสอบหน้าตัดผสมที่มีประสิทธิภาพ"
IDS_POSITION = "ตำแหน่ง"
IDS_EQUATION_FOR_K = "สมการสำหรับ k"
IDS_STEEL_TOP_FLANGE = "เหล็กฟลานจ์บน"
IDS_STEEL_WEB = "เหล็กเว็บ"
IDS_STEEL_BOT_FLANGE = "เหล็กฟลานจ์ล่าง"
IDS_CONCRETE_SLAB = "แผ่นคอนกรีต"
IDS_REINFORCING_STEEL = "เหล็กเสริม"
IDS_SECTION_MODULUS_AT_AN_INTERNAL_SUPPORT = "มอดูลัสหน้าตัดที่จุดรองรับภายใน"
IDS_TABLE_OF_SECTION_MODULUS_AT_EACH_PART_IN_SECTION = "ตารางมอดูลัสหน้าตัดของแต่ละส่วนในหน้าตัด"
IDS_STEEL_SECTION = "หน้าตัดเหล็ก"
IDS_COMPOSITE_SECTION = "หน้าตัดผสม"
IDS_CALCULATION_FOR_MOMENT_CAPACITY_OF_SECTION = "การคำนวณกำลังรับโมเมนต์ดัดของหน้าตัด"
IDS_PART = "ส่วน"
IDS_AXIAL_COMP_CAPACITY = "กำลังรับแรงอัดตามแนวแกน"
IDS_ARM_LENGTH = "ความยาวแขน"
IDS_MOMENT_CAPACITY_TABLE = "ความจุโมเมนต์"
IDS_TOTAL = "รวม"
IDS_ERROR = "ข้อผิดพลาด"
IDS_IN_CONCRETE_SLAB = "ในแผ่นคอนกรีต"
IDS_IN_STEEL_TOP_FLANGE = "ในฟลานจ์บนเหล็ก"
IDS_IN_STEEL_WEB = "ในเว็บเหล็ก"
IDS_IN_STEEL_BOT_FLANGE = "ในฟลานจ์ล่างเหล็ก"
IDS_PLASTIC_NEUTRAL_AXIS_IN_STEEL_BOT_FLANGE = "แกนเป็นกลางแบบพลาสติกในปีกล่างของเหล็ก"
IDS_PLASTIC_NEUTRAL_AXIS_IN_STEEL_WEB = "แกนเป็นกลางแบบพลาสติกในเอวของเหล็ก"
IDS_PLASTIC_NEUTRAL_AXIS_IN_WEB = "แกนเป็นกลางแบบพลาสติกในเอว"
IDS_PLASTIC_NEUTRAL_AXIS_IN_STEEL_WEB_HOLE = "แกนเป็นกลางแบบพลาสติกในรูเอวของเหล็ก"
IDS_PLASTIC_NEUTRAL_AXIS_IN_STEEL_TOP_FLANGE = "แกนเป็นกลางแบบพลาสติกในปีกบนของเหล็ก"
IDS_PLASTIC_NEUTRAL_AXIS_IN_CONCRETE_SLAB = "แกนเป็นกลางแบบพลาสติกในพื้นคอนกรีต"
IDS_CHECK_LONGITUDINAL_SHEAR_RESISTANCE = "ตรวจสอบความต้านทานแรงเฉือนตามยาว"
IDS_CACULATE_LONGITUDINAL_SHEAR_FORCE = "คำนวณแรงเฉือนตามยาว"
IDS_CALCULATE_DESIGN_SHEAR_RESISTANCE_OF_HEADED_STUD = "คำนวณความต้านทานแรงเฉือนออกแบบของสตัดหัว"
IDS_BENDING_RESISTANCE = "ความต้านทานการดัด"
IDS_LONGITUDINAL_SHEAR_RESISTANCE = "ความต้านทานแรงเฉือนตามยาว"
IDS_TABLE_OF_CALCULATION_FOR_K = "ตารางการคำนวณสำหรับ k"
IDS_VERTICAL_SHEAR_RESISTANCE = "ความต้านทานแรงเฉือนแนวตั้ง"
IDS_LONGITUDINAL_DIRECTION = "ทิศทางตามยาว"
IDS_MOMENT_CAPACITY_CALCULATION_REFERENCE = "เครื่องหมายของกำลังรับโมเมนต์ดัดถูกกำหนดโดยทิศทางของโมเมนต์ดัด โดยไม่ขึ้นกับทิศทางของแรง"
IDS_EFFECTIVE_WIDTH = "ความกว้างที่มีประสิทธิภาพ"
IDS_CHECK_REQUIREMENT_FOR_STUD_SMALL = "ตรวจสอบความต้องการสำหรับสตัด"
IDS_CHECK_SIZE_SMALL = "ตรวจสอบขนาด"
IDS_CHECK_MATERIAL_SMALL = "ตรวจสอบวัสดุ"
IDS_EC_MAJOR_AXIS_Y = "แกนหลัก (Y)"
IDS_EC_MINOR_AXIS_X = "แกนย่อย (X)"
IDS_CHECK_VERTICAL_SHEAR_RESISTANCE = "ตรวจสอบแรงเฉือนตามแนวตั้ง"
IDS_EC_REPORT_JP_TEST = "EC_Report_JP-Test(Lang:JP)"
IDS_EC_REPORT_RUS_TEST = "EC_Report_RUS-Test(Lang:RUS)"
IDS_EC_REPORT_TW_TEST = "EC_Report_TW-Test(Lang:TW)"
IDS_PLASTIC_MOMENT_RESISTANCE = "การคำนวณกำลังต้านทานโมเมนต์พลาสติก"
